sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
//===========================================================
// audio_transport.c
//
// Transitional shared audio integration for Sonora. This is NOT part of the public
// SPI/I2S/TDM HAL core and is NOT a CMSIS-wrapper dependency: the HAL core neither
// includes nor calls this file.
//
// This file currently owns codec/transport orchestration, callback composition,
// co-clock phase safety and recovery. Classic PCM interpretation, DSP processing,
// optional audio PWM calls and float work buffers are owned by
// apps/classic/classic_audio_path.c. ASRC processing and clock control are owned by
// apps/asrc/.
//
// Ownership: the DMA ping-pong buffers (the per-instance Tx_<name>/Rx_<name> generated
// from the instance list) remain owned by nora_spi_i2s_tdm_dspic33ak.c and are passed in as
// RX/TX half pointers. Application DSP work buffers are owned by each selected audio path.
//===========================================================

#include "resolved_board_config.h"
#include "resolved_sai_test_config.h"
#include "resolved_transport_policy.h"
#include "app_runtime_overrides.h"
#if RESOLVED_BOARD_COHERENT_OFFSET_CLOCK || RESOLVED_BOARD_SPI_CLOCK_FROM_PLL2
#include "board/clock/sonora_clock.h"   // Q27B / Q48 case1-2: re-source CLKGEN9 from PLL2 after codec-A is up
#endif

#include <xc.h>
#include <stdint.h>
#include <string.h>

#include <stdio.h>                   // printf (start-sequence logging)

#include "board/devices/wm8904.h"    // P5: codec lifecycle -- direct, down-call
#include "hal_reset/nora_reset.h"      // core reset cause: cold vs hot codec start at boot
#include "diagnostics/app_traps.h"     // app_traps_count(): tell a CPU fault from missing wiring
#include "timer_app.h"                          // delay_ms
#include "board/audio/audio.h"   // board pin/clock port table
#include "board/audio/tdm.h"     // board TDM topology table + per-leg resolver (Step 3)
#include "audio_transport.h"
#include "audio_transport_sai_live.h"      // P5: opt-in wrapper-live verification harness
#include "apps/audio_application_telemetry.h" // selected-app diagnostic consumer
#include "audio_transport_client.h"  // application-owned processing/lifecycle contract
#include "audio_transport_control.h" // neutral leg reconfiguration request
#include "audio_transport_snapshot.h" // neutral lifecycle/health telemetry
#include "nora_spi_i2s_tdm.h"   // transport API (configure/start/stop/status/rate-cb)
#include "nora_high_res_timer.h" // convert high-res-timer counts <-> us for the telemetry
#include "hal_timer/nora_cpu_load_prof.h" // DSPload: fixed-window, owner-attributed CPU load
#include "resolved_transport_config.h" // application-neutral topology facts


// I2C bus instances for MikroBUS-A and B codecs (Sonora board: R38/R39 removed).
// Used only in this file to call wm8904_* APIs.
#define I2C_INST_A  (2u)  /* I2C2 -- WM8904-A on MikroBUS-A */
#if APP_AK128_J3_TDM_B
#define I2C_INST_B  (1u)  /* I2C1 -- WM8904-B on MikroBUS-B, DIM-P4/P6 */
#else
#define I2C_INST_B  (3u)  /* I2C3 -- WM8904-B on MikroBUS-B */
#endif

/* An explicit *ts must remain terminal until a successful explicit start
 * (normally *tr).  The manage loop otherwise owns several recovery paths that
 * can restart a stopped transport after an unrelated clock/fault event. */
static bool s_preflash_stop_latched;
static bool s_preflash_stop_confirmed;

#if NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
/* Set the first time a dual-codec build's WM8904-B apply fails (codec absent/unanswering
 * on its I2C bus). Checked at the top of the manage loop so a missing codec-B produces ONE
 * reported failure instead of the manage loop retrying the whole start sequence every tick
 * forever (TDM_activated is reset to 0 by the failed start's teardown, so nothing else stops
 * it re-attempting). Cleared on the next start that actually succeeds. Gated behind
 * NORA_TDM_USE_SPI2 (like the rest of this feature): a single-codec build (e.g. AK128,
 * which has no MikroBUS-B I2C at all) can never hit this condition, and every byte here
 * competes with a build that was already at 99% ROM before this feature existed.
 * Also excluded from the AK128 J3 bring-up build for the same ROM reason -- see
 * audio_transport_report_codec_b_missing() below for why that build drops the
 * latch/guidance and not just this comment's original single-codec case. */
static bool s_codec_b_missing_stop_latched;
/* GetTicks() timestamp of the last codec-B-missing guidance print (first failure or a
 * periodic repeat -- see audio_transport_dbg_print()). Repeating matters because a USB-CDC
 * terminal that reconnects after the boot-time banner already scrolled by would otherwise
 * find a silent, healthy-looking console with no way to discover why. */
static uint32_t s_codec_b_missing_last_prt_ms;
#endif // NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B

/*
 * Per-leg converter role, stated once.
 *
 * At fs >= 88.2 kHz the WM8904 cannot run its ADC and DAC simultaneously (the
 * datasheet's boundary; 96 kHz is the only rate above it that this project builds),
 * so the high-rate topology splits them: A captures, B plays. Below that both legs
 * are full duplex.
 *
 * These are keyed on each leg's OWN nominal rate. Re-deriving the role at each
 * call site (or hardcoding it) is what previously made "same role, different
 * rate" unrepresentable on leg B.
 *
 * NOTE this is the BUILD-time role, matching the build's nominal rate, and a
 * runtime rate change deliberately does NOT move it:
 *
 *   - Dropping leg B 96k -> 48k leaves it DAC-only. Legal, not full-duplex, and it
 *     keeps the A->B path intact -- which is what this build is for.
 *   - Dropping leg A 96k -> 48k leaves it ADC-only, likewise.
 *
 * Letting the role follow the rate would silently turn a one-way A->B image into a
 * full-duplex one mid-run, which the ASRC route is not set up to agree with. The
 * consequence to remember when reading telemetry: after "*ar 0 x" leg A is a
 * 48 kHz-family ADC-only capture, NOT a full-duplex codec.
 */
#if RESOLVED_TRANSPORT_LEG_A_INITIAL_NOMINAL_RATE_HZ >= 88200u
#define AUDIO_TRANSPORT_LEG_A_ROLE   WM8904_ROLE_ADC_ONLY
#else
#define AUDIO_TRANSPORT_LEG_A_ROLE   WM8904_ROLE_ADC_DAC
#endif

#if RESOLVED_TRANSPORT_LEG_B_INITIAL_NOMINAL_RATE_HZ >= 88200u
#define AUDIO_TRANSPORT_LEG_B_ROLE   WM8904_ROLE_DAC_ONLY
#else
#define AUDIO_TRANSPORT_LEG_B_ROLE   WM8904_ROLE_ADC_DAC
#endif

#if RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED
// Step-1 phase-probe accumulators (SPI1 vs SPI2 ping-pong alignment). Sampled each SPI1
// block in app_block_cb_leg_a; printed on the audio_transport_dbg_print telemetry line.
static volatile uint32_t s_phase_samples    = 0u;
static volatile uint32_t s_phase_mismatch   = 0u;  // h1 != h2 at block START (coarse offset)
static volatile uint32_t s_phase_unresolved = 0u;  // either half unresolved this sample
static volatile int      s_phase_h1         = -1;  // last SPI1 active half (block start)
static volatile int      s_phase_h2         = -1;  // last SPI2 active half (block start)
// Sub-block position diff measured AT THE B-WRITE instant (after process, ~t=628us). This is
// the deadline-relevant sample: pos(SPI1)-pos(SPI2) in words, wrapped to [-half,+half). A fixed
// non-zero value = the offset that tears the late cross-fill even when block-start halves match.
static volatile int32_t  s_phase_wdiff_last = 0;
static volatile int32_t  s_phase_wdiff_min  = 32767;
static volatile int32_t  s_phase_wdiff_max  = -32768;
static volatile uint32_t s_phase_tail_tear  = 0u;  // post-write: SPI2 already transmitting b_dst half
#endif // RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED

#if RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
// Phase-mismatch guard state (opt-in). s_sync_bad_run counts consecutive blocks where SPI2
// crossed its ping-pong boundary during the SPI1 callback (= B cross-fill would tear); when it
// reaches the configured trip threshold, s_sync_resync_needed asks the manage loop to mute + re-sync
// the whole transport. Never trips with the aligned start (tail_tear=0).
static volatile uint32_t s_sync_bad_run       = 0u;
static volatile uint8_t  s_sync_resync_needed = 0u;
#endif // RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED

#if RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
// Startup phase-lock state. While s_stlock_verifying, the SPI1 block callback checks ALL lock
// conditions each block (|wdiff|<=tol, h1==h2, no tail_tear, safe B target) and counts consecutive
// OK blocks; at the configured qualification count it sets s_stlock_locked (and clears verifying). The start
// loop polls s_stlock_locked. Runtime (outside verify): a NULL mirror (unsafe B target) sets
// s_phase_fault_pending so the manage loop mutes + re-syncs the whole transport (ISR never restarts).
static volatile uint8_t  s_stlock_verifying    = 0u;
static volatile uint8_t  s_stlock_locked       = 0u;
static volatile uint32_t s_stlock_consec       = 0u;
static volatile uint8_t  s_phase_fault_pending = 0u;
// Consecutive UNRESOLVED_DMA_POSITION mirror results (runtime, outside the verify window). A single
// out-of-range live-DMA read at the co-clocked reload boundary is a benign transient (B skips one
// block); only a PERSISTENT run (a real phase loss) escalates to a whole-transport resync.
static volatile uint8_t  s_mirror_unresolved_run = 0u;
// last-block telemetry snapshot (for the PHLOCK try line)
static volatile int32_t  s_stlock_wdiff        = 0;
static volatile uint8_t  s_stlock_halfmm       = 0u;   // 1 = h1!=h2 this block
static volatile uint8_t  s_stlock_tailtear     = 0u;   // 1 = SPI2 half changed across callback
static volatile uint8_t  s_stlock_unsafe       = 0u;   // 1 = mirror refused (target==active)
#endif // RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED


