sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
/*
 * Prepare the selected application for the current leg-A sample rate.
 *
 * This does not initialize the SPI/I2S/TDM transport, CMSIS-SAI wrapper, or codec
 * hardware. The guard keeps restart paths from re-initializing DSP state.
 */
static void audio_transport_prepare_client( uint32_t sample_rate_hz )
{
    // (Phase D) fs-AWARE guard: the A-side DSP is tuned for the A-domain rate. Re-run only when that
    // rate actually changed, so a genuine A rate switch (*ar codec=A) re-tunes every fs-parameterized
    // module (meter/gain/tone/fx/widen/bassenh/flip4/delay), while same-rate resync restarts
    // (phase-fault / clock-resume) and B-only rate changes stay no-ops. Runs while muted inside
    // audio_transport_start_route, so re-tuning coefficients here is safe.
    static uint32_t s_tuned_fs = 0u;

    if( sample_rate_hz == s_tuned_fs )
    {
        return;
    }
    s_tuned_fs = sample_rate_hz;

    // Sample interpretation and application DSP preparation stay behind the
    // selected client's contract; transport does not select an application.
    const audio_transport_client_t* client = audio_transport_client_get();
    if( client != NULL )
    {
        client->prepare( sample_rate_hz, client->user );
    }

    // (Phase D) s_tuned_fs was set at the top of this function (fs-aware guard); nothing to latch here.
}


// The A<->B ASRC engine (FIFOs, cubic resampler, drift control, telemetry) lives in
// apps/asrc/audio_app_asrc.c/.h. ASRC route wiring and its SPI callbacks live beside that engine in
// apps/asrc/asrc_audio_path.c; this integration file registers the selected callbacks and uses the
// narrow ASRC lifecycle/telemetry interface. The per-route "output DSP" is only the LED gain meter
// (level_meter_process_i32, int32 direct -- no float convert/scratch). Call the engine via
// audio_app_asrc_push_ab/pull_ab/push_ba/pull_ba/reset_all/dbg_print.


// ---- co-clock transport wrapper: leg A's callback ALSO fills leg B's TX half (same-phase,
//      zero skew). The transport resolves the safe writable B half and owns all phase safety;
//      the selected client only interprets and processes the sample words. ----
#if RESOLVED_TRANSPORT_LEG_B_PRESENT && \
    (RESOLVED_TRANSPORT_TOPOLOGY == TRANSPORT_TOPOLOGY_CO_CLOCKED_SINGLE_PRODUCER_VALUE)
static void audio_transport_process_coclock( const audio_transport_client_t* client,
                                             const int32_t*                  src,
                                             int32_t*                        dst )
{
    // Legacy co-clock topology: leg A's callback ALSO fills leg B's TX half (A/B same-phase,
    // zero skew). Choose SPI2's half by MIRRORING SPI1's just-handed fill half (`dst`), NOT
    // by reading SPI2's live TX DMA: a live snapshot taken here goes stale when SPI2 crosses
    // its own block boundary during a long (high-load) callback, so the write can land in the
    // half SPI2 is transmitting -> tearing (e.g. the 80-stage DRC load test). Mirroring is
    // deterministic and valid for the whole block. Restores the pre-refactor single-DMA0
    // (src,dst_a,dst_b) behaviour on the independent-instance HAL.
    int32_t* b_dst = NULL;
    const nora_spi_i2s_tdm_mirror_result_t b_res =
        nora_spi_i2s_tdm_inst_tx_fill_mirror(
            audio_transport_tdm_leg_b(), audio_transport_tdm_leg_a(), dst, &b_dst );
#if RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
    // Runtime B-write safety (outside the startup verify window). b_dst is non-NULL only on OK
    // (a NULL b_dst means B is skipped this block -- NULL-safe copy). Distinguish the mirror result
    // so a transient reload-boundary UNRESOLVED does not immediately force a whole-transport resync,
    // while a genuine UNSAFE (target == transmitting half) faults at once. ISR only sets the flag.
    if( !s_stlock_verifying )
    {
        switch( b_res )
        {
            case NORA_TDM_MIRROR_OK:
                s_mirror_unresolved_run = 0u;
                break;
            case NORA_TDM_MIRROR_UNRESOLVED_DMA_POSITION:
                // Tolerate a few consecutive transients; escalate only if it persists.
                if( s_mirror_unresolved_run < 0xFFu ) { s_mirror_unresolved_run++; }
                if( s_mirror_unresolved_run >=
                    RESOLVED_TRANSPORT_MIRROR_UNRESOLVED_TOLERANCE_BLOCKS )
                {
                    s_phase_fault_pending = 1u;
                }
                break;
            case NORA_TDM_MIRROR_UNSAFE_ACTIVE_HALF:
                s_mirror_unresolved_run = 0u;
                s_phase_fault_pending   = 1u;   // real phase problem -> resync now
                break;
            case NORA_TDM_MIRROR_BAD_ARGUMENT:
            default:
                // Should not occur on this fixed spi1/spi2/dst path; fault closed if it ever does.
                s_mirror_unresolved_run = 0u;
                s_phase_fault_pending   = 1u;
                break;
        }
    }
    // Startup verify: sample leg A/B halves at block START (t~0).
    int slk_h1 = -1, slk_h2_pre = -1;
    if( s_stlock_verifying )
    {
        slk_h1     = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_a() );
        slk_h2_pre = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_b() );
    }
#endif // RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
#if RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
    // Guard: SPI2's transmitting half at block START. If it differs from the half at the B-write
    // (post-process) instant, SPI2 crossed its boundary during the callback = a torn cross-fill.
    const int gh_pre = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_b() );
#endif // RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
#if RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED
    // (a) block-START (t~0): coarse half compare. Co-clocked in-phase => equal.
    const int h1_pre = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_a() );
    const int h2_pre = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_b() );
    s_phase_samples++;
    s_phase_h1 = h1_pre;
    s_phase_h2 = h2_pre;
    if( ( h1_pre < 0 ) || ( h2_pre < 0 ) ) { s_phase_unresolved++; }
    else if( h1_pre != h2_pre )            { s_phase_mismatch++;   }
#endif // RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED

    client->co_clock_process( src, dst, b_dst, client->user );

#if RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
    // Startup verify: at the B-write instant, evaluate ALL lock conditions. wdiff==0 alone is NOT
    // sufficient (HW: wdiff=0 with tail_tear=samp still tore), so tail_tear / half-mismatch / unsafe
    // target are vetoes. All must hold for the configured number of blocks to declare LOCK.
    if( s_stlock_verifying )
    {
        const int     h2_post = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_b() );
        const int32_t p1      = nora_spi_i2s_tdm_inst_tx_active_pos( audio_transport_tdm_leg_a() );
        const int32_t p2      = nora_spi_i2s_tdm_inst_tx_active_pos( audio_transport_tdm_leg_b() );
        const int32_t half = (int32_t)( RESOLVED_TRANSPORT_SLOTS_PER_FRAME *
                                        RESOLVED_TRANSPORT_BLOCK_FRAMES );
        int32_t       wd      = 0;
        uint8_t       ok      = 1u;

        if( ( p1 >= 0 ) && ( p2 >= 0 ) )
        {
            wd = p1 - p2;
            if( wd >=  half ) { wd -= 2 * half; }
            if( wd <  -half ) { wd += 2 * half; }
        }
        else { ok = 0u; }                                   // unresolved -> not OK
        const int32_t wd_abs = ( wd < 0 ) ? -wd : wd;
        const uint8_t halfmm  = ( slk_h1 < 0 || slk_h2_pre < 0 || slk_h1 != slk_h2_pre ) ? 1u : 0u;
        const uint8_t tailt   = ( slk_h2_pre < 0 || h2_post < 0 || h2_post != slk_h2_pre ) ? 1u : 0u;
        const uint8_t unsafe  = ( b_res != NORA_TDM_MIRROR_OK ) ? 1u : 0u;

        if( wd_abs > (int32_t)RESOLVED_TRANSPORT_PHASE_LOCK_TOLERANCE_WORDS ) { ok = 0u; }
        if( halfmm || tailt || unsafe )                { ok = 0u; }

        s_stlock_wdiff = wd; s_stlock_halfmm = halfmm; s_stlock_tailtear = tailt; s_stlock_unsafe = unsafe;
        if( ok )
        {
            if( ++s_stlock_consec >=
                (uint32_t)RESOLVED_TRANSPORT_PHASE_LOCK_REQUIRED_BLOCKS )
            {
                s_stlock_locked = 1u;
                s_stlock_verifying = 0u;
            }
        }
        else { s_stlock_consec = 0u; }
    }
#endif // RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
#if RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
    // Guard post-check (at the B-write instant): SPI2's half changed during the callback => tear.
    // Count consecutive bad blocks; on TRIP, ask the manage loop to mute + re-sync the transport.
    {
        const int gh_post = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_b() );
        if( ( gh_pre >= 0 ) && ( gh_post >= 0 ) && ( gh_post != gh_pre ) )
        {
            if( ++s_sync_bad_run >=
                (uint32_t)RESOLVED_TRANSPORT_SYNC_GUARD_TRIP_BLOCKS )
            {
                s_sync_resync_needed = 1u;
            }
        }
        else
        {
            s_sync_bad_run = 0u;
        }
    }
#endif // RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
#if RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED
    // (b) B-WRITE instant (~t=628us, after the heavy DSP): the deadline-relevant sample.
    //   wdiff = pos(SPI1)-pos(SPI2) in words, wrapped [-half,+half): a fixed non-zero =
    //           sub-block offset (invisible to the block-start half compare).
    //   tail_tear = SPI2's half CHANGED vs block-start => it crossed its boundary during the
    //           callback and is now transmitting the half we just filled = the actual tear.
    {
        const int32_t p1 = nora_spi_i2s_tdm_inst_tx_active_pos( audio_transport_tdm_leg_a() );
        const int32_t p2 = nora_spi_i2s_tdm_inst_tx_active_pos( audio_transport_tdm_leg_b() );
        if( ( p1 >= 0 ) && ( p2 >= 0 ) )
        {
            const int32_t half =
                (int32_t)( RESOLVED_TRANSPORT_SLOTS_PER_FRAME *
                           RESOLVED_TRANSPORT_BLOCK_FRAMES );
            int32_t d = p1 - p2;
            if( d >=  half ) { d -= 2 * half; }
            if( d <  -half ) { d += 2 * half; }
            s_phase_wdiff_last = d;
            if( d < s_phase_wdiff_min ) { s_phase_wdiff_min = d; }
            if( d > s_phase_wdiff_max ) { s_phase_wdiff_max = d; }
        }
        const int h2_post = nora_spi_i2s_tdm_inst_tx_active_half( audio_transport_tdm_leg_b() );
        if( ( h2_pre >= 0 ) && ( h2_post >= 0 ) && ( h2_post != h2_pre ) ) { s_phase_tail_tear++; }
    }
#endif // RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED
}
#endif // co-clock topology with leg B


