sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
/*
 * Co-clock logical leg-A callback. The wrapper owns transport topology and
 * phase safety, then delegates sample interpretation to the selected client.
 */
#if RESOLVED_TRANSPORT_TOPOLOGY == TRANSPORT_TOPOLOGY_CO_CLOCKED_SINGLE_PRODUCER_VALUE
static void app_block_cb_leg_a( const int32_t* src, int32_t* dst, void* user )
{
    (void)user;
    const audio_transport_client_t* client = audio_transport_client_get();
    if( ( client == NULL ) || ( client->co_clock_process == NULL ) )
    {
        return;
    }
#if RESOLVED_TRANSPORT_LEG_B_PRESENT
    audio_transport_process_coclock( client, src, dst );
#else
    client->co_clock_process( src, dst, NULL, client->user );
#endif
}
#endif // co-clock topology


// NOTE: the _DMAxInterrupt vectors are NOT here and are not the app's concern: the HAL
// defines them itself inside nora_spi_i2s_tdm_dspic33ak.c (generated from the instance list),
// built with the transport so even a CMSIS-only configuration gets them. audio_app only
// registers the block callback (above).


//===========================================================
// TDM stream lifecycle / orchestration (moved from main.c).
//
// audio_app is the TOP of the audio transport call tree: main() chooses HAL-direct
// or CMSIS-SAI wrapper route, then pumps the matching manage function. Everything
// below is called DOWNWARD and DIRECTLY (codec = board/devices/wm8904,
// transport = HAL core or CMSIS wrapper, config = audio_app, DSP = this file).
// The one allowed indirection is the HAL core's block callback (app_block_cb, above)
// and the rate-change callback below, both registered with the core.
//===========================================================

typedef enum
{
    AUDIO_TRANSPORT_ROUTE_HAL_DIRECT = 0,
    AUDIO_TRANSPORT_ROUTE_CMSIS_SAI,
} audio_transport_route_t;

// "Stream should be running" state owned by the app (distinct from the core's
// is_running(): this guards the codec+transport bring-up/teardown sequence).
static uint8_t TDM_activated = 0;
static uint32_t s_stream_epoch = 0u;
static audio_transport_transition_reason_t s_last_transition =
    AUDIO_TRANSPORT_TRANSITION_NONE;
static audio_transport_transition_error_t s_last_transition_error =
    AUDIO_TRANSPORT_TRANSITION_ERROR_NONE;
static bool s_stream_qualified = false;
static bool s_transition_failed = false;
static bool s_mute_held_by_failed_transition = false;
static uint32_t s_current_configured_rate_hz[AUDIO_TRANSPORT_SNAPSHOT_MAX_LEGS] =
{
    RESOLVED_TRANSPORT_LEG_A_INITIAL_RATE_HZ,
    RESOLVED_TRANSPORT_LEG_B_INITIAL_RATE_HZ,
};

static bool audio_transport_start_route_impl( audio_transport_route_t route,
                                        bool unmute_on_success,
                                        audio_transport_transition_reason_t reason );
static void audio_transport_start_route( audio_transport_route_t route,
                                   audio_transport_transition_reason_t reason );
static bool audio_transport_manage_route( audio_transport_route_t route );
static bool audio_transport_restart_route( audio_transport_route_t route,
                                     audio_transport_transition_reason_t reason );
static bool audio_transport_restart_route_muted( audio_transport_route_t route );

static void audio_transport_mark_qualified(
    audio_transport_transition_reason_t reason )
{
    s_stream_epoch++;
    s_last_transition = reason;
    s_stream_qualified = true;
    s_last_transition_error = AUDIO_TRANSPORT_TRANSITION_ERROR_NONE;
    s_transition_failed = false;
    s_mute_held_by_failed_transition = false;
}

static void audio_transport_mark_transition_failed(
    audio_transport_transition_error_t error )
{
    s_stream_qualified = false;
    s_last_transition_error = error;
    s_transition_failed = true;
    s_mute_held_by_failed_transition = true;
}

#if NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
// Text shared by the first-failure print (below) and the periodic repeat in
// audio_transport_dbg_print(). Kept as one function so the two call sites can never drift.
static void audio_transport_print_codec_b_missing_guidance( void )
{
    printf(" audio_transport_start: WM8904-B did not answer -- stopping (NOT retrying).\n" );

    /*
     * A TRAP SINCE POWER-ON MEANS THIS IS PROBABLY NOT WIRING.  The wiring questions
     * below are the right first move for a board that never had a working leg B, and
     * completely the wrong move for a leg B that WAS working and then stopped: a trap
     * resets the part, so the restart that follows finds the codec mid-reconfigure and
     * reports it as absent.  Measured 2026-08-27: every 24 / 22.05 / 11.025 kHz `*ar`
     * on the AK512 BiDir image takes a STACK ERROR at __CCP2Interrupt+0 and warm-boots,
     * and this text sent the reader to check jumpers on a board whose jumpers were fine
     * (GitHub issue #4).
     *
     * app_traps_count() is the right question and not app_traps_previous_get(): the
     * record is consumed by the boot report, the COUNTER deliberately survives it, so
     * this still fires when the fault happened several restarts ago.
     */
    const uint32_t traps = app_traps_count();
    if( traps != 0u )
    {
        printf("   NOTE: %lu trap(s) since power-on -- suspect a CPU FAULT, not wiring.\n"
               "         A trap resets the part; the restart after it can report a\n"
               "         healthy codec as absent.  Read the boot banner's\n"
               "         \"AK TRAP on the previous run\" block FIRST, and only work\n"
               "         through the wiring list below if there is no trap there.\n",
               (unsigned long)traps );
    }

    printf("   Check, then power-cycle or *tr to try again:\n"
           "   1) Is a SECOND WM8904 codec board fitted on MikroBUS-B?\n"
           "   2) Has the Curiosity Platform's A/B I2C bridge (R38/R39) been removed?\n"
           "   3) Running with only ONE codec board (Classic only)? Set\n"
           "      APP_REQ_MIKROB_WM8904 to 0 in src/app/app_specific_config_defs.h and rebuild.\n" );
}

// Called from every WM8904-B apply-failure site in a dual-codec build. Latches the stop
// (see s_codec_b_missing_stop_latched) and prints the guidance once immediately;
// audio_transport_dbg_print() takes over repeating it every 2 s from here on.
static void audio_transport_report_codec_b_missing( void )
{
    s_codec_b_missing_stop_latched = true;
    s_codec_b_missing_last_prt_ms = GetTicks();
    audio_transport_print_codec_b_missing_guidance();
}
#elif NORA_TDM_USE_SPI2
// AK128 J3 bring-up (APP_BUILD_ASRC_AK128_CODEC_BIDIR) is ROM-critical (98% at
// merge time) and its whole point is the P0/P1 hardware acceptance sequence
// that finds a missing/unanswering WM8904-B by hand before any image is
// trusted -- so the multi-line guidance text and its stop-latch are dropped
// here rather than gated per call site. The apply failure itself still prints
// (see the unconditional "WM8904-B apply failed" lines at each call site) and
// the manage loop simply retries every tick, same as before this feature
// existed. Stub keeps every call site below unchanged.
static void audio_transport_report_codec_b_missing( void )
{
}
#endif // NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B

// Analog mute/unmute both codecs (A, and B if the dual-SPI MikroB topology is used).
// Brackets the stop side of a stop/restart so a rate-switch/forced-restart doesn't pop.
static void audio_transport_mute( bool mute )
{
    wm8904_set_analog_output_mute( I2C_INST_A, mute );
#if NORA_TDM_USE_SPI2
    wm8904_set_analog_output_mute( I2C_INST_B, mute );
#endif // NORA_TDM_USE_SPI2
}

