sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
// Route-aware transport teardown. The two transport routes commit the HAL in different config
// modes, so they must tear down through different APIs:
//   HAL_DIRECT : configure_system() -> SYSTEM mode -> stop_all_domains() + close().
//   CMSIS_SAI  : the wrapper's inst_configure(spi1) -> SINGLE mode, where stop_all_domains()
//                returns ERR_CONFIG_MODE (no HW change). Tear down through the wrapper's own
//                disable path (audio_transport_sai_live_stop -> inst_stop(spi1) + close()).
// TDM_activated is cleared ONLY after a successful teardown -- a failed stop must not masquerade
// as stopped (the stream may still be running; the caller/telemetry should see that).
static bool audio_transport_stop_route( audio_transport_route_t route )
{
    bool ok;

    if( !TDM_activated )
    {
        return true;   // already stopped (idempotent)
    }

    // R(review): mute the codecs BEFORE stopping the transport. Otherwise a path that stops
    // without an explicit pre-mute (e.g. the is_active()==false clock-loss fallback in
    // audio_transport_manage) would leave the WM8904 unmuted with no BCLK/FS -> DC-servo / output-stage
    // pop. Stop always means "no audio", so muting first is always correct (idempotent).
    audio_transport_mute( true );

    if( route == AUDIO_TRANSPORT_ROUTE_CMSIS_SAI )
    {
#if RESOLVED_SAI_TEST_LIVE_ENABLED
        ok = audio_transport_sai_live_stop();
#else
        ok = true;   // CMSIS-LIVE route not built in this config -- nothing to tear down
#endif
    }
    else
    {
        // Stop the whole transport (every sync domain / every leg) then release the shared port.
        // Domain-level teardown mirrors start_all_domains(): no per-leg enumeration, so added legs
        // (SPI3/SPI4, extra domains) are covered automatically and none leak.
        ok = nora_spi_i2s_tdm_stop_all_domains();
        if( ok )
        {
            ok = nora_spi_i2s_tdm_close();
        }
    }

    if( !ok )
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_STOP_FAILED );
        printf(" audio_transport_stop: transport teardown FAILED route=%d err=%d (still active)\n",
               (int)route, (int)nora_spi_i2s_tdm_get_last_error() );
        return false;   // do NOT fake a stop
    }

    TDM_activated = 0;
    s_stream_qualified = false;
    printf(" audio_transport_stop: TDM_activated=0 route=%d\n", (int)route );
    return true;
}


// Public HAL-direct stop wrapper (unchanged signature). The CMSIS route stops via
// audio_transport_cmsis_sai_stop(); internal fault/restart paths call audio_transport_stop_route(route).
void audio_transport_stop( void )
{
    // Compat wrapper: dispatch to the selected route per the resolved SAI selection, matching
    // audio_transport_start/manage/restart (header contract). A CMSIS-LIVE build commits the HAL in
    // SINGLE mode, where the HAL_DIRECT teardown (stop_all_domains) would no-op with ERR_CONFIG_MODE.
#if RESOLVED_SAI_TEST_LIVE_ENABLED
    (void)audio_transport_stop_route( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI );
#else
    (void)audio_transport_stop_route( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT );
#endif
}

bool audio_transport_stop_for_flash( void )
{
    bool mute_ok;
    bool stopped;

    /* Mute and verify first.  A programmer reset while HPOUT is live is the
     * POP hazard; stopping DMA first still leaves the codec output live during
     * the I2C transaction.  Repeating *ts re-proves the quiet state. */
    s_preflash_stop_latched = true;
    mute_ok = wm8904_set_analog_output_mute_verified( I2C_INST_A, true );
#if NORA_TDM_USE_SPI2
    mute_ok = wm8904_set_analog_output_mute_verified( I2C_INST_B, true ) && mute_ok;
#endif

#if RESOLVED_SAI_TEST_LIVE_ENABLED
    stopped = audio_transport_stop_route( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI );
#else
    stopped = audio_transport_stop_route( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT );
#endif

    s_preflash_stop_confirmed = mute_ok && stopped;
    if( s_preflash_stop_confirmed )
    {
        /* This phrase is the flash-tool gate.  It must never be emitted by
         * either failure path below. */
        printf(" audio transport: stopped by *ts (analog mute verified, TDM/DMA halted)\n");
    }
    else
    {
        printf(" audio transport: *ts stopped TDM/DMA=%d, but analog mute NOT verified; "
               "do NOT flash or reset this board yet\n", stopped ? 1 : 0);
    }
    return s_preflash_stop_confirmed;
}


void audio_transport_stop_for_flash_report( void )
{
    if( s_preflash_stop_confirmed )
    {
        printf(" ?ts: stopped by *ts (analog mute verified, TDM/DMA halted)\n");
    }
    else if( s_preflash_stop_latched )
    {
        printf(" ?ts: *ts did NOT establish verified analog mute; do NOT flash or reset\n");
    }
    else
    {
        printf(" ?ts: no pre-flash stop has been confirmed since boot or restart\n");
    }
}


static bool audio_transport_bind_transport_once( void )
{
    // One-time binding, done by the orchestrator (this layer) before the first
    // configure()/start()/is_active(): bind the board/clock PORT to the HAL core.
    // Keeping it here (not in main) leaves main an entry point only. It is a downward,
    // direct call -- no callbacks added.
    static bool s_bound = false;
    if( !s_bound )
    {
        // set_port() is a fail-closed bool API (rejects while opened/running). Latch s_bound only
        // on success so a rejected bind is retried on the next call rather than silently skipped.
        if( !nora_spi_i2s_tdm_set_port( &audio_transport_board_port ) )   // pin/CLC + clock hooks -> core
        {
            return false;   // caller must NOT proceed with codec shutdown/init + transport start
        }
        s_bound = true;
    }
    return true;
}

#if RESOLVED_TRANSPORT_DUAL_CLOCK_PROGRESS_ENABLED
// Main-loop liveness watchdog. FRMERR is sampled from the RX-block ISR, so it cannot detect a
// transport whose RX DMA has stopped completely. The client's clock-progress source is independent
// of that DMA: if framing keeps advancing while block_count does not, the transport is dead rather
// than clockless.
typedef struct {
    uint32_t last_block_count;
    uint32_t last_capture_count;
    uint32_t block_progress_ms;
    uint32_t clock_progress_ms;
    bool     seeded;
} tdm_liveness_watch_t;

static tdm_liveness_watch_t s_live_a;
static tdm_liveness_watch_t s_live_b;

static void tdm_liveness_watch_reset( void )
{
    memset( &s_live_a, 0, sizeof(s_live_a) );
    memset( &s_live_b, 0, sizeof(s_live_b) );
}

static bool tdm_liveness_inst_stalled( tdm_liveness_watch_t* watch,
                                       const nora_spi_i2s_tdm_status_t* status,
                                       uint32_t capture_count,
                                       uint32_t now_ms )
{
    if( !status->running )
    {
        watch->seeded = false;
        return false;
    }
    if( !watch->seeded )
    {
        watch->last_block_count   = status->block_count;
        watch->last_capture_count = capture_count;
        watch->block_progress_ms  = now_ms;
        watch->clock_progress_ms  = now_ms;
        watch->seeded             = true;
        return false;
    }
    if( status->block_count != watch->last_block_count )
    {
        watch->last_block_count  = status->block_count;
        watch->block_progress_ms = now_ms;
    }
    if( capture_count != watch->last_capture_count )
    {
        watch->last_capture_count = capture_count;
        watch->clock_progress_ms  = now_ms;
    }

    const bool clock_alive = (uint32_t)( now_ms - watch->clock_progress_ms )
                             < RESOLVED_TRANSPORT_LIVENESS_STALL_TIMEOUT_MS;
    const bool blocks_dead = (uint32_t)( now_ms - watch->block_progress_ms )
                             >= RESOLVED_TRANSPORT_LIVENESS_STALL_TIMEOUT_MS;
    return clock_alive && blocks_dead;
}

