sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
static bool tdm_liveness_stalled( uint32_t now_ms )
{
    if( !TDM_activated )
    {
        tdm_liveness_watch_reset();
        return false;
    }

    const audio_transport_client_t* client = audio_transport_client_get();
    if( ( client == NULL ) ||
        ( ( client->capabilities & AUDIO_TRANSPORT_CLIENT_CAP_CLOCK_PROGRESS ) == 0u ) ||
        ( client->clock_progress == NULL ) )
    {
        tdm_liveness_watch_reset();
        return false;
    }

    nora_spi_i2s_tdm_status_t st_a;
    if( !nora_spi_i2s_tdm_get_status( &st_a, false ) )
    {
        return false;
    }
    bool stalled = tdm_liveness_inst_stalled( &s_live_a, &st_a,
                                              client->clock_progress(
                                                  AUDIO_TRANSPORT_LEG_A, client->user ),
                                              now_ms );
// A masked leg B cannot be judged for liveness: block_count is the very evidence of progress,
// and it is frozen by design. Including it would declare a healthy transport stalled every time.
#if NORA_TDM_USE_SPI2 && !RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED
    nora_spi_i2s_tdm_inst_t* leg_b = audio_transport_tdm_leg_b();
    nora_spi_i2s_tdm_status_t st_b;
    if( ( leg_b != NULL ) && nora_spi_i2s_tdm_inst_get_status( leg_b, &st_b, false ) )
    {
        stalled = tdm_liveness_inst_stalled( &s_live_b, &st_b,
                                             client->clock_progress(
                                                 AUDIO_TRANSPORT_LEG_B, client->user ),
                                             now_ms ) || stalled;
    }
#endif
    return stalled;
}


// Bit-slip AUTO-RECOVERY (connector-glitch frame-slip). A sustained FRMERR on either leg starts a
// muted recovery episode. The proven full restart (== *nt03) is retried until both legs advance
// blocks again; a frozen leg cannot re-trigger from its stopped FRMERR counter, so liveness drives
// retries. Exhausting the bounded attempt budget latches safe-mute. CHECK_MS/COOLDOWN_MS prevent a
// transient from causing a tight restart loop. s_frmerr_recover_count reports restart attempts.
static uint32_t s_frmerr_recover_count = 0u;

uint32_t audio_transport_frmerr_recover_count( void )
{
    return s_frmerr_recover_count;
}

// Tier 3 latch. Declared outside the AUTORECOVER guard so the accessor always links (returns
// false when auto-recover is compiled out). Only ever SET inside the guarded recover tick.
static bool s_frmerr_safe_mute = false;

// True once the recovery has latched a safe-mute (could not re-lock). Shown on telemetry so the
// operator sees "silent fault" instead of a mystery. Cleared only by a full restart / power cycle.
bool audio_transport_frmerr_safe_mute( void ) { return s_frmerr_safe_mute; }

#if RESOLVED_TRANSPORT_FRMERR_AUTORECOVERY_ENABLED
static uint8_t s_frmerr_restarts   = 0u;   // restart attempts in the current recovery episode
static bool    s_frmerr_recovering = false;// in a mute+restart-until-healthy episode
static bool    s_frmerr_force_trip = false;// TEST (*nt43): force one recovery episode on next tick

// TEST hook: arm a one-shot forced recovery so the restart-until-healthy path can be exercised
// without a physical FS disturbance (see audio_transport_frmerr_recover_tick). It runs the same restart
// (== *nt03) a real slip would: on this fix the transport goes healthy and unmutes; if it could
// not re-lock it would latch a safe-mute -- never a loud/deadlocked stream.
void audio_transport_frmerr_force_trip( void ) { s_frmerr_force_trip = true; }

bool audio_transport_frmerr_autorecovery_available( void ) { return true; }

// Recovery must prove more than "DMA moved". Count only NEW blocks observed after the muted
// restart, and reset the clean run whenever FRMERR is observed. This prevents a continuously
// misframed-but-moving stream from being declared healthy and unmuted.
typedef struct {
    uint32_t last_block_count;
    uint32_t last_frm_count;
    uint32_t clean_blocks;
    bool     seeded;
} frmerr_clean_watch_t;

static bool frmerr_clean_watch_update( frmerr_clean_watch_t* watch,
                                       const nora_spi_i2s_tdm_status_t* status )
{
    if( !status->running )
    {
        watch->seeded = false;
        watch->clean_blocks = 0u;
        return false;
    }
    if( !watch->seeded )
    {
        watch->last_block_count = status->block_count;
        watch->last_frm_count   = status->err_frm_block_count;
        watch->clean_blocks     = 0u;
        watch->seeded           = true;
        return false;
    }

    const uint32_t new_blocks = status->block_count - watch->last_block_count;
    if( ( status->err_frm_block_count != watch->last_frm_count ) ||
        ( status->frmerr_consecutive_blocks != 0u ) )
    {
        watch->clean_blocks = 0u;
    }
    else if( new_blocks != 0u )
    {
        const uint32_t room = UINT32_MAX - watch->clean_blocks;
        watch->clean_blocks += ( new_blocks > room ) ? room : new_blocks;
    }
    watch->last_block_count = status->block_count;
    watch->last_frm_count   = status->err_frm_block_count;
    return watch->clean_blocks >= RESOLVED_TRANSPORT_RECOVERY_QUALIFY_BLOCKS;
}

static bool frmerr_transport_clean( frmerr_clean_watch_t* watch_a,
                                    frmerr_clean_watch_t* watch_b )
{
    nora_spi_i2s_tdm_status_t st_a;
    bool clean = nora_spi_i2s_tdm_get_status( &st_a, false )
                 && frmerr_clean_watch_update( watch_a, &st_a );
#if NORA_TDM_USE_SPI2 && !RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED
    nora_spi_i2s_tdm_inst_t* leg_b = audio_transport_tdm_leg_b();
    nora_spi_i2s_tdm_status_t st_b;
    clean = ( leg_b != NULL )
            && nora_spi_i2s_tdm_inst_get_status( leg_b, &st_b, false )
            && frmerr_clean_watch_update( watch_b, &st_b )
            && clean;
#else
    // Leg B's block ISR is masked (see RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED), so its
    // block_count never advances. This watcher counts CLEAN BLOCKS -- with a frozen counter it
    // would never qualify and would hold every recovery episode open forever. Leg A carries the
    // verdict, which is sound here: one clock feeds both legs, and B's data is A's mirror.
    (void)watch_b;
#endif
    return clean;
}

