sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
// Worst consecutive-FRMERR run across both legs (0 when clean; also 0 when a leg is frozen).
static uint32_t frmerr_worst_consecutive( void )
{
    uint32_t consec = 0u;
    nora_spi_i2s_tdm_status_t st;
    if( nora_spi_i2s_tdm_get_status( &st, false ) ) { consec = st.frmerr_consecutive_blocks; }
    // Masked leg B: its frmerr bookkeeping is ISR-maintained and therefore frozen. Reading it
    // would report a stale run as if it were current, so leg A alone answers here.
#if NORA_TDM_USE_SPI2 && !RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED
    {
        nora_spi_i2s_tdm_inst_t*  leg_b = audio_transport_tdm_leg_b();
        nora_spi_i2s_tdm_status_t st2;
        if( ( leg_b != NULL ) &&
            nora_spi_i2s_tdm_inst_get_status( leg_b, &st2, false ) &&
            ( st2.frmerr_consecutive_blocks > consec ) )
        {
            consec = st2.frmerr_consecutive_blocks;
        }
    }
#endif
    return consec;
}

// One restart attempt: the proven full re-lock (audio_transport_restart == *nt03: mute -> stop -> codec
// re-init -> phase-locked start -- the ONLY action that re-locks a persistently-slipped codec-
// master leg on this HW; a transport-only re-arm does NOT), then wait (bounded) for the transport
// to report HEALTHY. Blocks the main loop for the attempt -- acceptable for a rare recovery event.
static bool frmerr_restart_attempt( void )
{
    bool started;
#if RESOLVED_SAI_TEST_LIVE_ENABLED
    started = audio_transport_restart_route_muted( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI );
#else
    started = audio_transport_restart_route_muted( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT );
#endif
    if( !started ) { return false; }

    frmerr_clean_watch_t watch_a = {0};
    frmerr_clean_watch_t watch_b = {0};
    const uint32_t t0 = GetTicks();
    while( (uint32_t)( GetTicks() - t0 ) <
           RESOLVED_TRANSPORT_RECOVERY_QUALIFY_TIMEOUT_MS )
    {
        if( frmerr_transport_clean( &watch_a, &watch_b ) ) { return true; }
    }
    return false;
}
#else
void audio_transport_frmerr_force_trip( void ) { }
bool audio_transport_frmerr_autorecovery_available( void ) { return false; }
#endif // RESOLVED_TRANSPORT_FRMERR_AUTORECOVERY_ENABLED

void audio_transport_frmerr_recover_tick( void )
{
#if RESOLVED_TRANSPORT_FRMERR_AUTORECOVERY_ENABLED
    static uint32_t last          = UINT32_MAX;
    static uint32_t cooldown_from = 0u;
    static bool     in_cooldown   = false;
    const uint32_t  cur           = GetTicks();

    // TEST hook (*nt43): force one recovery episode on demand (physical FS noise is hard to
    // reproduce). Bypass the self-gate/cooldown and clear any prior safe-mute latch / in-flight
    // episode so it is repeatable; it then runs the same mute+restart-until-healthy path a real
    // trip does.
    const bool forced = s_frmerr_force_trip;
    if( forced )
    {
        s_frmerr_force_trip = false;
        s_frmerr_safe_mute  = false;
        s_frmerr_recovering = false;
        s_frmerr_restarts   = 0u;
        in_cooldown         = false;
        tdm_liveness_watch_reset();
    }
    else
    {
        if( (uint32_t)( cur - last ) < RESOLVED_TRANSPORT_RECOVERY_CHECK_PERIOD_MS ) { return; }
        last = cur;

        if( s_frmerr_safe_mute ) { return; }   // latched silent fault: no more retries

        if( in_cooldown )
        {
            if( (uint32_t)( cur - cooldown_from ) < RESOLVED_TRANSPORT_RECOVERY_COOLDOWN_MS ) { return; }
            in_cooldown = false;
        }
    }

    // ENTER a recovery episode on a fresh FRMERR trip (>= threshold) or the forced test hook.
    // While recovering we DRIVE ON HEALTH, not the FRMERR counter (which freezes at 0 on a dead
    // leg and could never re-trigger -- the "doesn't recover" bug).
    const bool stalled = !forced && tdm_liveness_stalled( cur );
    if( !s_frmerr_recovering )
    {
        const uint32_t frm_run = frmerr_worst_consecutive();
        if( !forced && !stalled &&
            ( frm_run < RESOLVED_TRANSPORT_FRMERR_TRIGGER_BLOCKS ) )
        {
            return;
        }
        printf(" [tdm-recover] trigger=%s frm_run=%lu\n",
               stalled ? "liveness" : ( forced ? "forced" : "frmerr" ),
               (unsigned long)frm_run );
        s_frmerr_recovering = true;
        s_frmerr_restarts   = 0u;
        tdm_liveness_watch_reset();
    }

    // Anti-blast: keep MUTED across the whole episode. The recovery-only restart path also holds
    // mute through codec init and transport start; only the clean-frame success branch releases it.
    audio_transport_mute( true );

    s_frmerr_recover_count++;
    s_frmerr_restarts++;

    if( frmerr_restart_attempt() )
    {
        // Transport advanced through a clean-frame window while muted -> episode done.
        s_frmerr_recovering = false;
        tdm_liveness_watch_reset();
        audio_transport_mark_qualified(
            AUDIO_TRANSPORT_TRANSITION_FRMERR_RECOVERY );
        audio_transport_mute( false );
        in_cooldown = false;   // clean-window proof replaces the old post-success blind period
    }
    else if( s_frmerr_restarts >= RESOLVED_TRANSPORT_RECOVERY_MAX_RESTARTS )
    {
        // Restart could not re-lock within the attempt budget -> "correct deadlock": stay MUTED
        // and latch a fault (silence, not a blast, not a runaway). A full reboot / power cycle is
        // the operator's call. (Ongoing noise makes attempts no-ops; once it stops a retry wins,
        // so this latch only fires on a genuinely unrecoverable misalignment.)
        s_frmerr_safe_mute  = true;
        s_frmerr_recovering = false;
    }
    // A failed attempt stays muted and retries after the cooldown. Successful recovery resumes
    // monitoring immediately so a recurring fault cannot produce a 500-ms unobserved blast.
    if( s_frmerr_recovering )
    {
        cooldown_from = GetTicks();
        in_cooldown   = true;
    }
#endif // RESOLVED_TRANSPORT_FRMERR_AUTORECOVERY_ENABLED
}

void audio_transport_frmerr_reset( void )
{
#if RESOLVED_TRANSPORT_FRMERR_AUTORECOVERY_ENABLED
    // Clear the HAL's consecutive-frmerr counters (clear=true) on both legs and reseed the liveness
    // watch, then drop any in-flight recovery bookkeeping. After a *ap B-only restart, B's clock has
    // returned and clean blocks are flowing, so this leaves the manage loop with nothing to recover
    // from -- no log-flooding full-transport restart.
    nora_spi_i2s_tdm_status_t st;
    (void)nora_spi_i2s_tdm_get_status( &st, true );
#if NORA_TDM_USE_SPI2
    {
        nora_spi_i2s_tdm_inst_t*  leg_b = audio_transport_tdm_leg_b();
        nora_spi_i2s_tdm_status_t st2;
        if( leg_b != NULL ) { (void)nora_spi_i2s_tdm_inst_get_status( leg_b, &st2, true ); }
    }
#endif
    tdm_liveness_watch_reset();
    s_frmerr_recovering = false;
    s_frmerr_restarts   = 0u;
#endif // RESOLVED_TRANSPORT_FRMERR_AUTORECOVERY_ENABLED
}
#else // !RESOLVED_TRANSPORT_DUAL_CLOCK_PROGRESS_ENABLED
// Keep the public recovery/diagnostic API linkable in builds without the two-CCP clock detector.
// Those builds cannot distinguish a dead transport from a stopped external clock, so automatic
// liveness recovery is intentionally unavailable and the debug force hook is a harmless no-op.
uint32_t audio_transport_frmerr_recover_count( void ) { return 0u; }
bool audio_transport_frmerr_safe_mute( void ) { return false; }
void audio_transport_frmerr_force_trip( void ) { }
void audio_transport_frmerr_recover_tick( void ) { }
void audio_transport_frmerr_reset( void ) { }
bool audio_transport_frmerr_autorecovery_available( void ) { return false; }
#endif // RESOLVED_TRANSPORT_DUAL_CLOCK_PROGRESS_ENABLED


