sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
static void audio_transport_snapshot_copy_leg(
    audio_transport_leg_snapshot_t*              out,
    const nora_spi_i2s_tdm_status_t* status,
    uint8_t                                physical_spi_instance,
    uint32_t                               configured_rate_hz,
    uint32_t                               callback_deadline_us10 )
{
    out->present = true;
    out->active = status->active;
    out->running = status->running;
    out->deadline_miss_latched = status->block_deadline_miss_count != 0u;
    out->physical_spi_instance = physical_spi_instance;
    out->configured_rate_hz = configured_rate_hz;
    out->block_count = status->block_count;
    out->callback_last_us10 = status->load.last_us10;
    out->callback_peak_us10 = status->load.max_us10;
    out->callback_deadline_us10 = callback_deadline_us10;
    out->deadline_miss_count = status->block_deadline_miss_count;
    out->rx_dma_overrun_count = status->rx_dma_overrun_count;
    out->rx_dma_other_irq_count = status->rx_dma_other_irq_count;
    out->rx_dma_last_status = status->rx_dma_last_status;
    out->rx_overrun_block_count = status->err_rov_block_count;
    out->tx_underrun_block_count = status->err_tur_block_count;
    out->frame_error_block_count = status->err_frm_block_count;
}

static bool audio_transport_controller_timing(
    const transport_static_cfg_t*     transport_cfg,
    const transport_leg_static_cfg_t* leg_cfg,
    uint32_t*                         rate_hz,
    uint32_t*                         deadline_us10 )
{
    if( ( transport_cfg == NULL ) || ( leg_cfg == NULL ) ||
        ( rate_hz == NULL ) || ( deadline_us10 == NULL ) ||
        ( leg_cfg->clock_source != TRANSPORT_CLOCK_SOURCE_CONTROLLER ) ||
        ( leg_cfg->controller_clock_hz == 0u ) ||
        ( transport_cfg->slots_per_frame == 0u ) ||
        ( transport_cfg->word_bits == 0u ) )
    {
        return false;
    }

    const uint64_t frame_divisor =
        2ULL * ((uint64_t)leg_cfg->controller_brg + 1ULL) *
        (uint64_t)transport_cfg->slots_per_frame *
        (uint64_t)transport_cfg->word_bits;
    *rate_hz = (uint32_t)((uint64_t)leg_cfg->controller_clock_hz /
                          frame_divisor);
    *deadline_us10 =
        (uint32_t)(((uint64_t)transport_cfg->block_frames * frame_divisor *
                    10000000ULL) /
                   (uint64_t)leg_cfg->controller_clock_hz);
    return true;
}

static bool audio_transport_snapshot_read( audio_transport_snapshot_t* out,
                                           bool clear_callback_peaks )
{
    if( out == NULL )
    {
        return false;
    }

    memset( out, 0, sizeof(*out) );
    out->stream_epoch = s_stream_epoch;
    out->last_transition = s_last_transition;
    out->last_transition_error = s_last_transition_error;
    out->qualified_running = s_stream_qualified;
    out->safe_mute_latched = audio_transport_frmerr_safe_mute();
    out->transition_failed = s_transition_failed;
    out->mute_held_by_failed_transition = s_mute_held_by_failed_transition;
    /* Fail closed rather than under-report: this expression, and the explicit
     * A/B blocks below it, still assume a single leg pair.  A build that
     * allocates more legs must extend them instead of silently publishing a
     * snapshot that omits legs C and D. */
    _Static_assert( TRANSPORT_LEG_MAX == 2u,
                    "snapshot publication still assumes an A/B leg pair" );
    out->leg_count = RESOLVED_TRANSPORT_LEG_B_PRESENT ? 2u : 1u;

    uint32_t rate_a_hz =
        s_current_configured_rate_hz[AUDIO_TRANSPORT_LEG_A];
    uint32_t deadline_a_us10 = ( rate_a_hz != 0u )
        ? (uint32_t)(((uint64_t)RESOLVED_TRANSPORT_BLOCK_FRAMES * 10000000ULL) /
                     rate_a_hz)
        : 0u;
    (void)audio_transport_controller_timing(
        &g_resolved_transport_static_cfg,
        &g_resolved_transport_static_cfg.legs[TRANSPORT_LEG_A],
        &rate_a_hz,
        &deadline_a_us10 );
    nora_spi_i2s_tdm_status_t status_a;
    if( !nora_spi_i2s_tdm_get_status( &status_a, clear_callback_peaks ) )
    {
        return false;
    }
    audio_transport_snapshot_copy_leg( &out->legs[AUDIO_TRANSPORT_LEG_A],
                                       &status_a,
                                       (uint8_t)RESOLVED_TRANSPORT_LEG_A_SPI_INSTANCE,
                                       rate_a_hz,
                                       deadline_a_us10 );

#if RESOLVED_TRANSPORT_LEG_B_PRESENT
    nora_spi_i2s_tdm_inst_t* leg_b = audio_transport_tdm_leg_b();
    nora_spi_i2s_tdm_status_t status_b;
    if( ( leg_b == NULL ) ||
        !nora_spi_i2s_tdm_inst_get_status(
            leg_b, &status_b, clear_callback_peaks ) )
    {
        return false;
    }

    uint32_t rate_b_hz =
        s_current_configured_rate_hz[AUDIO_TRANSPORT_LEG_B];
    uint32_t deadline_b_us10 = ( rate_b_hz != 0u )
        ? (uint32_t)(((uint64_t)RESOLVED_TRANSPORT_BLOCK_FRAMES * 10000000ULL) /
                     rate_b_hz)
        : deadline_a_us10;
    (void)audio_transport_controller_timing(
        &g_resolved_transport_static_cfg,
        &g_resolved_transport_static_cfg.legs[TRANSPORT_LEG_B],
        &rate_b_hz,
        &deadline_b_us10 );
    audio_transport_snapshot_copy_leg( &out->legs[AUDIO_TRANSPORT_LEG_B],
                                       &status_b,
                                       (uint8_t)RESOLVED_TRANSPORT_LEG_B_SPI_INSTANCE,
                                       rate_b_hz,
                                       deadline_b_us10 );
#endif

    return true;
}

bool audio_transport_snapshot_get( audio_transport_snapshot_t* out )
{
    return audio_transport_snapshot_read( out, false );
}

bool audio_transport_snapshot_take_window( audio_transport_snapshot_t* out )
{
    return audio_transport_snapshot_read( out, true );
}


static void audio_transport_start_hal_transport( void )
{
    const audio_transport_client_t* client = audio_transport_client_get();
    if( client == NULL )
    {
        printf(" audio_transport_start: no transport client bound\n");
        return;
    }

    // The selected application owns its stream state; clear it before callback
    // registration and before any transport domain starts.
    client->reset_stream_state( client->user );

    // Block callbacks:
    //  - Co-clock: one transport-owned wrapper resolves the safe B output half,
    //    then calls the client's single producer for A and optional B.
    //  - Independent domains: each ISR invokes its application-owned leg callback
    //    directly with the client's opaque context.
#if RESOLVED_TRANSPORT_TOPOLOGY == TRANSPORT_TOPOLOGY_CO_CLOCKED_SINGLE_PRODUCER_VALUE
    if( !nora_spi_i2s_tdm_set_block_callback( audio_transport_tdm_leg_a(), app_block_cb_leg_a, NULL ) )
#elif RESOLVED_TRANSPORT_TOPOLOGY == TRANSPORT_TOPOLOGY_INDEPENDENT_DUAL_DOMAIN_VALUE
    if( !nora_spi_i2s_tdm_set_block_callback(
            audio_transport_tdm_leg_a(), client->leg_a_process, client->user ) )
#else
    #error "Unsupported resolved transport topology"
#endif
    {
        printf(" audio_transport_start: failed to register leg-A block callback\n");
        return;
    }
#if RESOLVED_TRANSPORT_TOPOLOGY == TRANSPORT_TOPOLOGY_INDEPENDENT_DUAL_DOMAIN_VALUE
    // Independent domain: logical leg B has its own callback driven by its own
    // RX-block ISR; the board maps it to physical SPI2 or SPI4.
    if( !nora_spi_i2s_tdm_set_block_callback(
            audio_transport_tdm_leg_b(), client->leg_b_process, client->user ) )
    {
        printf(" audio_transport_start: failed to register leg-B block callback\n");
        return;
    }
#endif // independent dual-domain topology
    // The HAL core no longer derives its config from app macros -- configure each
    // instance ONCE from the platform default before the first start. Restarts re-apply
    // the stored per-instance config, so do NOT reconfigure here.
    static bool                         s_tdm_configured = false;
    if( !s_tdm_configured )
    {
        // The complete TDM configuration is the board system table
        // (board/audio/tdm.c): one fully-specified leg_setup per leg (stream +
        // sync domain), selected at build time. Pass it DIRECTLY to configure_system() in one
        // transactional (all-or-nothing) call -- no local copy, no per-leg resolve, no app-side
        // role rewrite. Fail closed: if the table is missing or configure fails, leave
        // s_tdm_configured false so open()/start below do not run.
        const nora_spi_i2s_tdm_leg_setup_t* setups = audio_transport_board_tdm_system();
        const uint8_t                            setup_count = audio_transport_board_tdm_leg_count();
        if( ( setups != NULL ) &&
            ( setup_count == (uint8_t)AUDIO_TDM_LEG_COUNT ) &&
            nora_spi_i2s_tdm_configure_system( setups, setup_count ) )
        {
            s_tdm_configured = true;
        }
    }

