sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
    // Open the shared port once, then start every sync domain PHASE-LOCKED: start_all_domains()
    // arms each domain's legs together and releases their SPIEN back-to-back (slaves first,
    // clock-master last) so co-clocked members latch one FS edge (wdiff=0). open() takes no role
    // -- it derives the clock role from the committed primary leg, so the app cannot pass a role
    // that contradicts the configured stream. start_all_domains rolls back every domain it
    // started on failure, so the app only closes the port here. (Ordering + phase-lock live in
    // the HAL, keyed on each leg's sync_domain + committed config.clock_role.)
    bool ok = nora_spi_i2s_tdm_open();
#if RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED && NORA_TDM_USE_SPI2 && \
    (RESOLVED_TRANSPORT_TOPOLOGY == TRANSPORT_TOPOLOGY_CO_CLOCKED_SINGLE_PRODUCER_VALUE)
    // Deterministic co-clocked startup (still MUTED here; unmute happens later, gated on is_running).
    // Start, then verify the domain phase-locked over the configured number of consecutive blocks
    // (ALL conditions: wdiff<=tol, no half-mismatch, no tail_tear, safe B target). If not locked,
    // re-arm and retry. Only a locked start leaves the transport running -> the caller unmutes.
    if( ok )
    {
        ok = false;
        for( int attempt = 1;
             attempt <= RESOLVED_TRANSPORT_PHASE_LOCK_MAX_RETRIES;
             attempt++ )
        {
            s_stlock_consec = 0u; s_stlock_locked = 0u; s_stlock_verifying = 1u;
            if( !nora_spi_i2s_tdm_start_all_domains() ) { s_stlock_verifying = 0u; break; }
            delay_ms( RESOLVED_TRANSPORT_PHASE_LOCK_WAIT_MS );
            s_stlock_verifying = 0u;
            printf(" PHLOCK try=%d wdiff=%ld halfmm=%d tailtear=%d unsafe=%d consec=%lu\n",
                   attempt, (long)s_stlock_wdiff, (int)s_stlock_halfmm, (int)s_stlock_tailtear,
                   (int)s_stlock_unsafe, (unsigned long)s_stlock_consec );
            if( s_stlock_locked ) { printf(" PHLOCK locked try=%d\n", attempt); ok = true; break; }
            nora_spi_i2s_tdm_stop_all_domains();  // misaligned -> tear down (still muted) + retry
            printf(" PHLOCK retry\n");
        }
        if( !ok )
        {
            printf(" PHLOCK failed retries=%d mute-held\n",
                   RESOLVED_TRANSPORT_PHASE_LOCK_MAX_RETRIES );
        }
    }
#else
    if( ok )
    {
        ok = nora_spi_i2s_tdm_start_all_domains();
    }
#endif // resolved startup phase-lock policy
    if( !ok )
    {
        nora_spi_i2s_tdm_close();
        return;
    }

#if RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED
    // Started and (where enabled) phase-locked: only now mask leg B's RX-block ISR. Not earlier --
    // the startup phase-lock verify must run against an untouched start, and it reads leg A's
    // callback anyway. Every start comes through here, so a restart re-applies the mask (a stop
    // masks both legs' IRQs and a start re-enables them, so this is not a one-shot).
    //
    // The compile-time gate cannot see leg_b_process, which is a runtime field: a client that DOES
    // consume codec B's ADC must keep its ISR even in a DRC build, so check and refuse rather than
    // silently drop its callback.
    {
        const audio_transport_client_t* gate_client = audio_transport_client_get();
        nora_spi_i2s_tdm_inst_t*        gate_leg_b  = audio_transport_tdm_leg_b();
        if( ( gate_client != NULL ) && ( gate_client->leg_b_process != NULL ) )
        {
            printf(" audio_transport_start: leg-B IRQ gate DECLINED --"
                   " the client registered a leg-B callback\n");
        }
        else if( ( gate_leg_b != NULL ) &&
                 nora_spi_i2s_tdm_inst_set_block_irq_enabled( gate_leg_b, false ) )
        {
            printf(" audio_transport_start: leg-B (TDM%u) block IRQ masked --"
                   " RX unread, TX mirrored by TDM%u\n",
                   (unsigned)RESOLVED_TRANSPORT_LEG_B_SPI_INSTANCE,
                   (unsigned)RESOLVED_TRANSPORT_LEG_A_SPI_INSTANCE);
        }
        else
        {
            printf(" audio_transport_start: leg-B IRQ gate FAILED -- ISR left armed\n");
        }
    }
#endif // RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED
}

static void audio_transport_start_cmsis_sai_transport( void )
{
#if RESOLVED_SAI_TEST_LIVE_ENABLED
    // Opt-in verification: drive the stream through the CMSIS-SAI wrapper harness
    // (isolated in audio_transport_sai_live.c) instead of the demo DSP path.
    audio_transport_sai_live_start();
#else
    printf(" audio_transport_start: CMSIS-SAI live route requested but the live test is disabled\n");
#endif // RESOLVED_SAI_TEST_LIVE_ENABLED
}

static void audio_transport_start_transport( audio_transport_route_t route )
{
    if( route == AUDIO_TRANSPORT_ROUTE_CMSIS_SAI )
    {
        audio_transport_start_cmsis_sai_transport();
    }
    else
    {
        audio_transport_start_hal_transport();
    }
}

static bool audio_transport_start_route_impl(
    audio_transport_route_t                    route,
    bool                                 unmute_on_success,
    audio_transport_transition_reason_t  reason )
{
    if( TDM_activated )
    {
        return true;    // already started.
    }
    if( audio_transport_client_get() == NULL )
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_START_FAILED );
        printf(" audio_transport_start: no transport client bound -- aborting route start\n");
        return false;
    }

    // (Phase D) Tune the A-side DSP to the A-domain codec rate. In the codec-master build A is
    // runtime rate-settable, so read its current rate (default 48k); other builds keep the
    // compile-time SAMPLE_RATE (e.g. the 96k test path). The fs-aware guard inside re-tunes only
    // when the rate actually changed.
#if RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE
    audio_transport_prepare_client( wm8904_get_rate_hz( I2C_INST_A ) );
#else
    audio_transport_prepare_client(
        RESOLVED_TRANSPORT_LEG_A_INITIAL_NOMINAL_RATE_HZ );
#endif
    if( !audio_transport_bind_transport_once() )
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_START_FAILED );
        printf(" audio_transport_start: TDM port bind failed -- aborting route start\n");
        return false;   // fail closed BEFORE codec shutdown/init + transport start
    }

    // There is deliberately NO codec pre-shutdown here any more. The discharge that keeps a re-init
    // from popping lives inside wm8904_init_role(), immediately before the codec is configured.
    //
    // One rule, no inputs: each codec is discharged immediately before it is initialised. Every
    // wm8904_init*() call site in this function already sits where that leg's clock is running --
    // that is precisely why a controller-clocked leg is initialised after the transport start -- so
    // "wait until the clock this codec will use is present" is satisfied by construction instead of
    // by a predicate. What that deleted three of, all of which had produced a real defect:
    //
    //   * the PROCESSOR reset cause (RCON) standing in for "might this codec have a live HPOUT".
    //     A codec's charge state is not a property of how the dsPIC was reset, and the substitution
    //     is what made an MCLR reset -- POR and EXTR both set, so read as cold -- silently skip the
    //     very path it was being used to test.
    //   * a per-topology decision about WHERE each codec may be quiesced. The vendor write sequencer
    //     needs the codec's own SYSCLK, and in a co-clocked build leg B's MCLK is leg A's clock,
    //     which nothing drives this early: quiescing B here could not work and left it wedged, so
    //     leg B failed its first apply on every warm boot (T2.8, 2026-08-11).
    //   * the "is this the first bring-up" test. Discharging a codec that already sits at its reset
    //     defaults costs ~294 ms of write sequencer and changes nothing else, so it does not earn a
    //     condition -- every condition here was another chance to be wrong about board state.

