sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
    /*
     * Seed each codec's tracked rate from this build's nominal rate, exactly ONCE per
     * boot, before the very first codec init. The driver's per-instance default is
     * 48000, so a 96 kHz build must state its rate explicitly or the first configure
     * would program 48 kHz values.
     *
     * A ONE-SHOT FLAG is used deliberately, not a comparison against current state.
     * This function also runs on every restart -- including the restart that a rate
     * CHANGE performs -- and at that moment the requested rate is already in the codec
     * driver while s_current_configured_rate_hz[] still holds the OLD value (it is only
     * updated after the restart succeeds). Any state-comparing guard therefore reads as
     * "not changed yet" and pushes the nominal rate back over the request, silently.
     *
     * That is exactly the bug this comment used to describe as fixed: leg B lost its
     * rate to a frame-error auto-recovery restart, and then leg A lost its rate to the
     * rate-change restart itself. Same shape both times -- a path asked to do one thing
     * also quietly re-asserting another, and reporting success. Seed once, then never
     * touch the rate here again.
     */
    {
        static bool nominal_rate_seeded = false;
        if( !nominal_rate_seeded )
        {
            nominal_rate_seeded = true;
            (void)wm8904_set_rate_hz( I2C_INST_A,
                                      RESOLVED_TRANSPORT_LEG_A_INITIAL_NOMINAL_RATE_HZ );
#if NORA_TDM_USE_SPI2
            (void)wm8904_set_rate_hz( I2C_INST_B,
                                      RESOLVED_TRANSPORT_LEG_B_INITIAL_NOMINAL_RATE_HZ );
#endif // NORA_TDM_USE_SPI2
        }
    }

    // How this image configures the codec. Printed unconditionally and before any
    // codec is touched: it describes the image, not a leg. (This line once lived
    // inside the MikroB block, which made it invisible on exactly the boards where
    // B is an I2C alias of A -- bridged MikroBUS -- so the one build fact the A/B
    // procedure said to confirm from the banner could not be confirmed there.)
    printf("  WM8904 config path: UNIFIED (rate table + role)\n");

    // init CODEC board (master case: codec drives BCLK/FS before the transport starts)
#if RESOLVED_TRANSPORT_LEG_A_CLOCK_SOURCE != TRANSPORT_CLOCK_SOURCE_CONTROLLER_VALUE
    printf("---------------------------------------------\n");
    printf("WM8904 on MikroA is configured as TDM Master.\n");
    printf("---------------------------------------------\n");
#if RESOLVED_TRANSPORT_LEG_A_INITIAL_NOMINAL_RATE_HZ == 96000u
    if( !wm8904_init_role( I2C_INST_A, true, AUDIO_TRANSPORT_LEG_A_ROLE ) )
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-A apply failed -- staying muted\n");
        return false;
    }
#else
    if( !wm8904_init( I2C_INST_A, true ) )   // config as TDM master
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-A apply failed -- staying muted\n");
        return false;
    }
#endif // 96 kHz nominal rate
    delay_ms(100);
#endif // leg A is not controller-clocked

#if RESOLVED_BOARD_COHERENT_OFFSET_CLOCK
    // Q27B coherent fixed-offset test: WM8904-A (codec master) is now up, so its fixed 12.288 MHz
    // XTAL_OUT (fs-independent, not BCLK) is present on RP16. Re-source CLKGEN9 (SPI2's transport
    // clock) from PLL2 LOCKED to A's XTAL_OUT (via REFI1) BEFORE the SPI2 transport starts below, so
    // SPI2 generates a BCLK coherent (low wander) with A. The fixed A:B offset comes from the
    // unchanged SPI2 BRG. CPU stays on PLL1 (DSP SYS unchanged). PWM is off (PLL2 reused). Only
    // dsPIC PLL2 + BRG are used (no FLL, no jitter).
    {
        nora_clock_status_t q27b_detail = NORA_CLOCK_OK;
        sonora_clock_pwm_status_t q27b = sonora_clock_q27b_coherent_clkgen9( &q27b_detail );
        // status=0 => PLL2 locked to A and CLKGEN9 re-sourced (CPU stays on PLL1 -- see main.c's
        // SysClock banner for the separate, boot-time CPU-coherence path).
        printf(" *Q27B: CLKGEN9<-PLL2(REFI1<-A XTAL_OUT) status=%d detail=%d (coherent w/ A)\n",
               (int)q27b, (int)q27b_detail );
        if( q27b != SONORA_CLOCK_PWM_OK )
        {
            // Same rule as the PLL2 transport-clock path below: the whole point of
            // this build is a coherent clock, so falling through to PLL1 would run
            // the transport on a clock nobody asked for.
            audio_transport_mark_transition_failed(
                AUDIO_TRANSPORT_TRANSITION_ERROR_CLOCK_SETUP_FAILED );
            printf(" audio_transport_start: Q27B coherent-clock setup FAILED"
                   " -- transport NOT started, staying muted\n");
            return false;
        }
        delay_ms(20);   // let PLL2/CLKGEN9 settle before the SPI2 master starts
    }
#endif // RESOLVED_BOARD_COHERENT_OFFSET_CLOCK

#if RESOLVED_BOARD_SPI_CLOCK_FROM_PLL2
    // WM8904-A (codec master) is up, so its fixed 12.288 MHz XTALout is present on REFI1<-RP16. Re-source
    // CLKGEN9 (SPI2's transport clock) from PLL2<-REFI1 BEFORE the SPI2 transport starts, so it is
    // coherent with the codec. SysCLK stays on PLL1<-FRC. This runs here, application-side, precisely
    // because REFI1 has no reference any earlier.
    {
        nora_clock_status_t clk_detail = NORA_CLOCK_OK;
        sonora_clock_pwm_status_t st = sonora_clock_spi2_from_pll2( &clk_detail );
        printf(" *CLKGEN9<-PLL2<-REFI1: status=%d detail=%d\n",
               (int)st, (int)clk_detail );
        if( st != SONORA_CLOCK_PWM_OK )
        {
            // Report and stop. Starting the transport anyway would run SPI2 on
            // PLL1 instead of the codec-coherent clock that was asked for, which
            // is exactly the "do not force progress on an unintended clock" rule
            // in [internal] clock_design_contract.md. Leave the stream
            // muted and let the caller/telemetry surface it.
            audio_transport_mark_transition_failed(
                AUDIO_TRANSPORT_TRANSITION_ERROR_CLOCK_SETUP_FAILED );
            printf(" audio_transport_start: PLL2 transport-clock setup FAILED"
                   " -- transport NOT started, staying muted\n");
            return false;
        }
        delay_ms(20);   // let PLL2/CLKGEN9 settle before the SPI2 master starts
    }
#endif // RESOLVED_BOARD_SPI_CLOCK_FROM_PLL2

#if RESOLVED_BOARD_CCP_TIMEBASE_FROM_PLL2
    // WM8904-A (codec master) is up, so its XTALout -- a fixed, fs-INDEPENDENT 12.288 MHz -- is
    // present on REFI1<-RP16. Re-source the CCP capture time base (CLKGEN13) from PLL2<-REFI1, so
    // the clock the ASRC measures sample rates WITH comes from the same crystal as the rates it
    // measures. Nothing else changes clock; SysCLK stays on PLL1<-FRC.
    //
    // Ordering, stated exactly, because it differs between the first start and a restart:
    //   first start  the CCP is not yet armed. Arming happens after this, inside
    //                audio_transport_start_transport() -> reset_stream_state() ->
    //                asrc_clock_control_init_reset().
    //   restart /    asrc_clock_control_init_reset() arms ONCE (a static flag), so the CCP is
    //   rate change  already running here and this call moves CLKGEN13 UNDER A LIVE CAPTURE.
    //                That is deliberate and it is safe for a specific reason, not by luck: the
    //                transport is muted across this window, and reset_stream_state() runs
    //                afterwards and calls ccpdet_reset(), which discards the captures and the
    //                queue that straddled the switch. So the only captures the servo ever sees
    //                are post-switch ones.
    // The stricter alternative -- stop the CCP, move CLKGEN13, re-arm -- was NOT taken: it would
    // add a stop/re-arm path to a hardware-verified sequence to remove a transient that is
    // already discarded. If ccpdet_reset() ever stops being called on the restart path, this
    // reasoning collapses and that alternative becomes necessary.
    {
        nora_clock_status_t clk_detail = NORA_CLOCK_OK;
        sonora_clock_pwm_status_t st = sonora_clock_ccp_timebase_from_pll2( &clk_detail );
        printf(" *CLKGEN13<-PLL2<-REFI1 (CCP time base): status=%d detail=%d\n",
               (int)st, (int)clk_detail );
        if( st != SONORA_CLOCK_PWM_OK )
        {
            // Report and stop, same rule as the SPI2 path above: arming the CCP anyway would
            // measure with the FRC time base while the build asked for the codec-coherent one,
            // and every reported rate would silently carry the FRC's error.
            audio_transport_mark_transition_failed(
                AUDIO_TRANSPORT_TRANSITION_ERROR_CLOCK_SETUP_FAILED );
            printf(" audio_transport_start: PLL2 CCP time-base setup FAILED"
                   " -- transport NOT started, staying muted\n");
            return false;
        }
        delay_ms(20);   // let PLL2/CLKGEN13 settle before the CCP time base is used
    }
#endif // RESOLVED_BOARD_CCP_TIMEBASE_FROM_PLL2

