sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
    // init and start the TDM transport
    audio_transport_start_transport( route );

    // Confirm the stream actually started BEFORE touching the codec. The WM8904 slave
    // DC-servo startup needs BCLK/LRCLK present, so configuring it when the stream did
    // not start is pointless. is_running() is the path-agnostic truth (demo start() or
    // the wrapper Control(CONTROL_TX) path). On failure stay muted and bail out.
    if( !nora_spi_i2s_tdm_is_running() )
    {
        TDM_activated = 0;
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_START_FAILED );
        printf(" audio_transport_start: stream did NOT start -- staying muted (TDM_activated=0)\n");
        return false;
    }
    TDM_activated = 1;

    delay_ms(50);

// note:
// In clock slave mode, BCLK/LRCLK must be present before DC servo startup.
// Otherwise the DC servo startup sequence may not complete, causing
// abnormal headphone output level/headroom.
#if RESOLVED_TRANSPORT_LEG_A_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_CONTROLLER_VALUE
    printf("---------------------------------------------\n");
    printf("WM8904 on MikroA is configured as TDM Slave.\n");
    printf("---------------------------------------------\n");
    if( !wm8904_init( I2C_INST_A, false ) )  // config as TDM slave
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-A apply failed -- mute-held teardown\n");
        (void)audio_transport_stop_route( route );
        return false;
    }
#endif // leg A is controller-clocked

#if NORA_TDM_USE_SPI2
    // Two-codec builds require the Curiosity A/B I2C bridge resistors (R38/R39)
    // depopulated. Bridged-I2C operation is unsupported. Firmware does not infer
    // physical board topology from codec register state -- see
    // [internal] codec_ab_startup_clock_gate.md for the removed alias-probe
    // design and why.
    // TDM Slave must be after nora_spi_i2s_tdm_start();
    printf("---------------------------------------------\n");
#if RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE
    printf("WM8904 on MikroB is configured as TDM MASTER (own 12.288MHz XTAL).\n");
#else
    printf("WM8904 on MikroB is configured as TDM Slave.\n");
#endif
    // State leg B's rate and converter role explicitly: at 96 kHz the WM8904 is
    // DAC-only (no simultaneous ADC+DAC above its 88.2 kHz boundary), which is the
    // fact that makes the 96 kHz ASRC one-way. Cheap, and it makes a mis-flashed
    // image obvious.
    // (The config-path line moved above, out of this leg-B-only block.)
    printf("  MikroB leg: %lu Hz, %s, %u slot(s)/frame\n",
           (unsigned long)RESOLVED_TRANSPORT_LEG_B_INITIAL_NOMINAL_RATE_HZ,
#if RESOLVED_TRANSPORT_LEG_B_INITIAL_NOMINAL_RATE_HZ == 96000u
           "DAC-only (96k: ADC+DAC not simultaneously supported)",
#else
           "ADC+DAC",
#endif
           (unsigned)RESOLVED_TRANSPORT_SLOTS_PER_FRAME );
    printf("---------------------------------------------\n");

    // Leg B's discharge happens inside its wm8904_init*() call below.

// Leg-B clock ownership is decided FIRST, then leg B's own rate selects the register
// set. The previous order tested leg A's rate before clock ownership, which had two
// consequences: a 96 kHz build could never reach the codec-master arm at all (so a
// B-XTAL codec-master image silently configured B as a SLAVE), and leg B's
// configuration depended on leg A's rate -- precisely the same-domain assumption the
// ASRC exists to remove. Leg A keeps its own rate test at its own call site above.
#if RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE
  #if RESOLVED_TRANSPORT_LEG_B_INITIAL_NOMINAL_RATE_HZ == 96000u
    // B-codec-master at 96 kHz: DAC-only (the WM8904 cannot run ADC and DAC
    // simultaneously above its 88.2 kHz boundary), clocked from its OWN 12.288 MHz XTAL via the
    // B-XTAL -> B-MCLK jumper, driving BCLK/FS as master (master_cfg=true sets
    // BCLK_DIR/LRCLK_DIR inside the shared 96 kHz interface configuration).
    if( !wm8904_init_role( I2C_INST_B, true, AUDIO_TRANSPORT_LEG_B_ROLE ) )
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-B apply failed -- mute-held teardown\n");
        (void)audio_transport_stop_route( route );
        audio_transport_report_codec_b_missing();
        return false;
    }
  #else
    // B-codec-master: WM8904-B drives BCLK/FS from its SYSCLK = its OWN 12.288 MHz XTAL
    // (board jumper B-XTAL -> B-MCLK; FLL off, SYSCLK_SRC=MCLK, 256fs @48k -- the existing
    // wm8904_config 48k path with master_cfg=true). The dsPIC SPI2 leg is a SLAVE on its own
    // independent domain: exactly like codec-A / SPI1, the codec-master init runs AFTER the
    // transport start and the slave SPI simply idles until B's externally-driven clock appears.
    if( !wm8904_init( I2C_INST_B, true ) )   // config as TDM MASTER
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-B apply failed -- mute-held teardown\n");
        (void)audio_transport_stop_route( route );
        audio_transport_report_codec_b_missing();
        return false;
    }
  #endif // leg B nominal rate
#elif RESOLVED_TRANSPORT_LEG_B_INITIAL_NOMINAL_RATE_HZ == 96000u
    // Classic 96 kHz co-clocked split (A=ADC master, B=DAC slave): unchanged
    // behaviour. Leg B is not endpoint-clocked here, and in this topology legs A
    // and B share one rate, so this is the same call the previous leg-A-keyed
    // test produced.
    if( !wm8904_init_role( I2C_INST_B, false, AUDIO_TRANSPORT_LEG_B_ROLE ) )
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-B apply failed -- mute-held teardown\n");
        (void)audio_transport_stop_route( route );
        audio_transport_report_codec_b_missing();
        return false;
    }
#else
    if( !wm8904_init( I2C_INST_B, false ) )  // config as TDM slave
    {
        audio_transport_mark_transition_failed(
            AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED );
        printf(" audio_transport_start: WM8904-B apply failed -- mute-held teardown\n");
        (void)audio_transport_stop_route( route );
        audio_transport_report_codec_b_missing();
        return false;
    }
#endif // resolved rate and leg-B clock ownership
#else
    printf("---------------------------------------------\n");
    printf("WM8904 on MikroB is disabled.\n");
    printf("---------------------------------------------\n");
#endif // NORA_TDM_USE_SPI2

    delay_ms(100);

#if RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
    // Clear any phase-fault latched during the (muted) startup/retry window before unmuting.
    // A retry teardown gap -- the verify window is already closed (s_stlock_verifying=0) but
    // the transport is not yet stopped -- can let an EXPECTED NULL-mirror skip set
    // s_phase_fault_pending. That is muted startup noise, not a runtime fault. We only reach
    // here on a confirmed running+locked start (is_running() gate above), so reset the latch:
    // otherwise a stale fault would make the FIRST manage_route mute + resync a perfectly good
    // stream (audible drop). Only faults detected AFTER unmute should trigger a resync.
    s_phase_fault_pending = 0u;
    // Re-arm the UNRESOLVED tolerance for this fresh lock. This point is reached on EVERY
    // running+locked start_route -- cold boot AND a post-resync restart -- so clearing the counter
    // here guarantees a fresh unresolved-position tolerance budget
    // starts from zero after a resync; otherwise a stale >=TOL count would re-fault on the first
    // post-restart transient block (the verify window never touches the counter).
    s_mirror_unresolved_run = 0u;
#endif // RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
    // A recovery start deliberately stays muted until a separate clean-frame/liveness check
    // succeeds. Normal starts preserve the original behavior and unmute here.
    if( unmute_on_success )
    {
        wm8904_set_analog_output_mute( I2C_INST_A, false );  // unmute A
#if NORA_TDM_USE_SPI2
        wm8904_set_analog_output_mute( I2C_INST_B, false );  // unmute B
#endif // NORA_TDM_USE_SPI2
    }

