sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
    if( unmute_on_success )
    {
        audio_transport_mark_qualified( reason );
        /* A completed explicit start/restart is the only operation that
         * releases the terminal pre-flash stop latch. */
        s_preflash_stop_latched = false;
        s_preflash_stop_confirmed = false;
#if NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
        s_codec_b_missing_stop_latched = false;   // this start reached here, so B answered
#endif // NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
    }
    else
    {
        s_stream_qualified = false;
    }
    printf(" audio_transport_start: TDM_activated=%d mute_held=%d\n",
           TDM_activated, unmute_on_success ? 0 : 1 );
    return true;
}

static void audio_transport_start_route(
    audio_transport_route_t                    route,
    audio_transport_transition_reason_t  reason )
{
    (void)audio_transport_start_route_impl( route, true, reason );
}

static bool audio_transport_manage_route( audio_transport_route_t route )
{
    if( s_preflash_stop_latched )
    {
        return false;
    }
#if NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
    // A missing/unanswering WM8904-B already reported once (see
    // audio_transport_report_codec_b_missing()) -- stay stopped instead of re-attempting
    // the whole start sequence every tick. An explicit *tr (audio_transport_restart_route)
    // still bypasses this and is free to try again.
    if( s_codec_b_missing_stop_latched )
    {
        return false;
    }
#endif // NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B

#if RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
    // Runtime phase fault: the block ISR found the B-write target half was SPI2's transmitting half
    // (mirror returned NULL -> B skipped that block) outside the startup verify window. Mute and
    // re-sync the WHOLE transport (start_route re-runs the startup phase-lock before unmuting).
    if( s_phase_fault_pending )
    {
        s_phase_fault_pending = 0u;
        printf(" [phase-fault] unsafe B-write target detected -> mute + whole-transport resync\n");
        audio_transport_mute( true );
        (void)audio_transport_stop_route( route );   // route-aware teardown (fail leaves TDM_activated set)
        audio_transport_start_route( route, AUDIO_TRANSPORT_TRANSITION_PHASE_RECOVERY );
        // re-verify phase-lock, unmute only when locked (no-op if stop failed)
        return true;
    }
#endif // RESOLVED_TRANSPORT_STARTUP_PHASE_LOCK_ENABLED
#if RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
    // Phase-mismatch guard: a persistent co-clocked leg-A/leg-B misalignment was detected in the
    // block ISR. Mute and re-sync the WHOLE transport (stop + start_route -> start_all_domains
    // re-locks phase); never poke a single leg. Never fires with the aligned start (tail_tear=0).
    if( s_sync_resync_needed )
    {
        s_sync_resync_needed = 0u;
        s_sync_bad_run       = 0u;
        printf(" [sync-guard] persistent leg-A/leg-B phase mismatch -> mute + whole-transport resync\n");
        audio_transport_mute( true );
        (void)audio_transport_stop_route( route );   // route-aware teardown (fail leaves TDM_activated set)
        audio_transport_start_route( route, AUDIO_TRANSPORT_TRANSITION_PHASE_RECOVERY );
        // re-open + start_all_domains; unmutes at its end (no-op if stop failed)
        return true;
    }
#endif // RESOLVED_TRANSPORT_SYNC_GUARD_ENABLED
    // External-clock stop/resume edge (slave mode; only fires when the board has clock
    // detection configured -- otherwise always NONE). STOPPED: mute+stop.
    // RESUMED: restart. NONE falls through to the steady-state level gate. Both paths
    // use the TDM_activated-guarded helpers, so they coexist safely.
    nora_spi_i2s_tdm_clock_event_t ev = nora_spi_i2s_tdm_consume_clock_event();
    if( ev == NORA_SPI_I2S_TDM_CLOCK_EVENT_STOPPED )
    {
        audio_transport_mute( true );
        (void)audio_transport_stop_route( route );
        return false;
    }
    else if( ev == NORA_SPI_I2S_TDM_CLOCK_EVENT_RESUMED )
    {
        audio_transport_start_route( route, AUDIO_TRANSPORT_TRANSITION_CLOCK_RESUME );
        return true;
    }

    if( !nora_spi_i2s_tdm_is_active() )
    {
        (void)audio_transport_stop_route( route );
        return false;
    }
    else
    {
        audio_transport_start_route( route, AUDIO_TRANSPORT_TRANSITION_CLOCK_RESUME );
        return true;
    }
}

// Forced mute-bounded SAME-RATE stop/restart of the audio stream. audio_transport_start_route()
// re-inits the codec, starts the transport, and unmutes at its end -- the only gap it
// leaves is muting before the stop, closed here. Exposed for the *nt03 debug command
// and reused as the clock-RESUMED action above.
static bool audio_transport_restart_route(
    audio_transport_route_t                    route,
    audio_transport_transition_reason_t  reason )
{
    printf(" [restart] mute + stop (same-rate restart)\n");
    audio_transport_mute( true );
    if( !audio_transport_stop_route( route ) )   // route-aware teardown; abort restart if it failed
    {
        printf(" [restart] aborted: teardown failed (transport left active)\n");
        return false;
    }
    const bool started = audio_transport_start_route_impl( route, true, reason );
    printf(" [restart] %s.\n", started ? "done" : "failed" );
    return started;
}

// Recovery-only restart. Unlike the normal route, this never unmutes inside start(); the caller
// must first prove a run of clean frames, then explicitly release mute. This closes the previous
// short blast window between audio_transport_restart() returning and a second mute write.
static bool audio_transport_restart_route_muted( audio_transport_route_t route )
{
    printf(" [restart] mute-held stop + restart\n");
    audio_transport_mute( true );
    if( !audio_transport_stop_route( route ) )
    {
        printf(" [restart] mute-held aborted: teardown failed\n");
        return false;
    }
    const bool ok = audio_transport_start_route_impl(
        route, false, AUDIO_TRANSPORT_TRANSITION_NONE );
    printf(" [restart] mute-held %s\n", ok ? "started" : "failed" );
    return ok;
}

void audio_transport_hal_start( void )
{
    audio_transport_start_route( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT,
                           AUDIO_TRANSPORT_TRANSITION_INITIAL_START );
}

bool audio_transport_hal_manage( void )
{
    return audio_transport_manage_route( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT );
}

