sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
void audio_transport_hal_stop( void )
{
    (void)audio_transport_stop_route( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT );
}

void audio_transport_cmsis_sai_start( void )
{
    audio_transport_start_route( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI,
                           AUDIO_TRANSPORT_TRANSITION_INITIAL_START );
}

bool audio_transport_cmsis_sai_manage( void )
{
    return audio_transport_manage_route( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI );
}

void audio_transport_cmsis_sai_stop( void )
{
    (void)audio_transport_stop_route( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI );
}

// App telemetry period (ms). Default from config; runtime-changeable via the setter.
static uint32_t s_dbg_period_ms = RESOLVED_TRANSPORT_DEBUG_PERIOD_MS;

void audio_transport_set_dbg_period_ms( uint32_t ms )
{
    s_dbg_period_ms = ms;
}

void audio_transport_dbg_enable( bool on )
{
    // Simple telemetry ON/OFF: ON restores the resolved default period, OFF (0) disables the line.
    s_dbg_period_ms = on ? (uint32_t)RESOLVED_TRANSPORT_DEBUG_PERIOD_MS : 0u;
}

bool audio_transport_dbg_enabled( void )
{
    // Period 0 is the single definition of "telemetry off" -- both *tq0000 and *tq0002 with a zero
    // period land here, so callers need not know which form was used.
    return ( s_dbg_period_ms != 0u );
}

static const char* audio_transport_transition_name(
    audio_transport_transition_reason_t reason )
{
    switch( reason )
    {
        case AUDIO_TRANSPORT_TRANSITION_INITIAL_START:   return "initial-start";
        case AUDIO_TRANSPORT_TRANSITION_MANUAL_RESTART:  return "manual-restart";
        case AUDIO_TRANSPORT_TRANSITION_RATE_CHANGE:     return "rate-change";
        case AUDIO_TRANSPORT_TRANSITION_RATE_CHANGE_ROLLBACK:
            return "rate-change-rollback";
        case AUDIO_TRANSPORT_TRANSITION_CLOCK_RESUME:    return "clock-resume";
        case AUDIO_TRANSPORT_TRANSITION_PHASE_RECOVERY:  return "phase-recovery";
        case AUDIO_TRANSPORT_TRANSITION_FRMERR_RECOVERY: return "frmerr-recovery";
        case AUDIO_TRANSPORT_TRANSITION_NONE:
        default:                                         return "none";
    }
}

static const char* audio_transport_transition_error_name(
    audio_transport_transition_error_t error )
{
    switch( error )
    {
        case AUDIO_TRANSPORT_TRANSITION_ERROR_STOP_FAILED:        return "stop-failed";
        case AUDIO_TRANSPORT_TRANSITION_ERROR_START_FAILED:       return "start-failed";
        case AUDIO_TRANSPORT_TRANSITION_ERROR_CODEC_APPLY_FAILED: return "codec-apply-failed";
        case AUDIO_TRANSPORT_TRANSITION_ERROR_CLOCK_SETUP_FAILED: return "clock-setup-failed";
        case AUDIO_TRANSPORT_TRANSITION_ERROR_NONE:
        default:                                                   return "none";
    }
}

static void audio_transport_dbg_print_leg_begin(
    const audio_transport_leg_snapshot_t* leg,
    uint8_t                               logical_leg )
{
    const uint32_t max_us10 = leg->callback_peak_us10;
    const uint32_t deadline_us10 = leg->callback_deadline_us10;
    const uint32_t load_x10 = ( deadline_us10 > 0u )
        ? (uint32_t)(((uint64_t)max_us10 * 1000ULL) / deadline_us10) : 0u;
    const int32_t margin_us10 = (int32_t)deadline_us10 - (int32_t)max_us10;

    /* resp=, not max=: this is the RX-block ISR's RESPONSE time (entry to exit), which
     * INCLUDES any higher-priority ISR that preempted it. Under an asymmetric priority map the
     * low-priority leg's figure therefore carries the other leg's execution time, so it is a
     * per-leg diagnostic, NOT a load. Engine load is the DSPload line below. */
    /* The percentage that used to follow resp= is GONE (2026-08-27): resp/deadline reads like a
     * load, and under an asymmetric priority map it is not one -- the demoted leg's figure carries
     * the other leg's execution time, so the number invited exactly the misreading the comment
     * above warns about (measured: 30.5% -> 62.6% on the demoted leg while the real DSP load moved
     * 0.2 pt). Load is the DSPload line; this line keeps resp and margin in microseconds.
     * [internal] design_brief_2026-08-27_telemetry_derived_thresholds_and_diet.md P1. */
    (void)load_x10;
    printf("TDM%u:resp=%lu.%luus margin=",
           (unsigned)leg->physical_spi_instance,
           (unsigned long)(max_us10 / 10u),
           (unsigned long)(max_us10 % 10u));
    if( margin_us10 < 0 )
    {
        const uint32_t magnitude = (uint32_t)(-margin_us10);
        printf("-%lu.%luus", (unsigned long)(magnitude / 10u),
                              (unsigned long)(magnitude % 10u));
    }
    else
    {
        printf("%lu.%luus", (unsigned long)((uint32_t)margin_us10 / 10u),
                            (unsigned long)((uint32_t)margin_us10 % 10u));
    }

    /*
     * The MEASURED rate this leg's resp/margin belong to, right after the margin they scale
     * with: the deadline is BLOCK/fs, so a reader who wants to know which rate a 105.9 us margin
     * was earned at had to divide it out by hand (and a mixed-rate pair makes that two divisions
     * per report). Measured, not configured -- 47792 where the codec was asked for 48000 -- and
     * omitted entirely when the application measures nothing, rather than printed as 0.
     * [internal] design_brief_2026-08-27_telemetry_derived_thresholds_and_diet.md section 7.
     */
    {
        const uint32_t fs_hz = audio_application_leg_measured_fs_hz( logical_leg );
        if( fs_hz != 0u ) { printf(" fs=%luHz", (unsigned long)fs_hz); }
    }
}

//===========================================================
// Engine-wide DSP load line ("DSPload").
//
// WHAT IT REPORTS
//   self    = leg A exclusive CPU time + leg B exclusive CPU time, over a FIXED measurement
//             window. This is the DSP load: the share of the CPU the audio legs actually
//             consumed. Exclusive means that when a higher-priority vector preempts a leg, the
//             preemptor's execution is charged to itself, not to the leg it interrupted.
//   stolen  = time a leg was held off by an instrumented higher-priority ISR. What the old
//             wall-time reading silently folded into the leg's own total is now its own number.
//   demand  = self + stolen: the CPU time the legs wanted, including what they waited for.
//
// A_self / B_self / self / stolen / demand are per-window MEANS over the windows closed since the
// previous print -- window-length independent, and the honest "what did it cost" figure.
// max_self / max_demand are the single worst window in that same interval; THAT is what the
// window length buys, because shortening the window pushes the peak toward the per-block truth.
//
// WHAT IT IS NOT
// A deadline instrument. The window is a fixed time, deliberately unrelated to the block period
// (10 ms is ~30 blocks at 333 us), so one late block is averaged away. Deadline margin lives in
// the per-leg TDM lines above (response time, preemption included) and in the real-harm counters
// miss / starve / ovf / udf / drop. Do not read margin from this line.
//
// WHY THE PREDECESSOR WAS REPLACED (2026-08-26)
// The TDMsum line printed the peak TIME UNION during which any TDM RX ISR was executing, over a
// window equal to the shortest running leg's block deadline and phase-locked to that leg's block
// boundary. Wall time is response time: under the rate-monotonic priority map
// (APP_ASRC_RATE_MONOTONIC_ISR, on by default) the demoted leg absorbs the promoted leg's whole
// execution, so the "union" over-counted by exactly the overlap it existed to remove -- 48k/44.1k
// read 100.0 % where the legs' own time summed to about 72.6 %. Figures labelled TDMsum elsewhere
// in this tree came from that instrument and are NOT comparable with these.
//
// NOT CLAMPED. A peak above the window is printed as-is with over= beside it; a load past the
// budget is the finding, and rounding it to "100.0%" is what made the old line unusable.
//
// The window length is a build default (APP_DSPLOAD_WINDOW_US, 10 ms) overridable live from the
// console, so 1 ms / 10 ms / 100 ms are comparable within one image. Nothing here hardcodes it.
//===========================================================

// Live window length in microseconds. Set from the console; 0 restores the build default.
static uint32_t s_dsploadprof_window_us = (uint32_t)( APP_DSPLOAD_WINDOW_US );

uint32_t audio_transport_dbg_set_dsploadprof_window_us( uint32_t window_us )
{
    s_dsploadprof_window_us = ( window_us != 0u )
        ? window_us : (uint32_t)( APP_DSPLOAD_WINDOW_US );
    return s_dsploadprof_window_us;
}

