sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
uint32_t audio_transport_dbg_get_dsploadprof_window_us( void )
{
    return s_dsploadprof_window_us;
}

/* Ticks -> tenths of a percent of the window. 64-bit because ticks * 1000 overflows 32 bits for
 * any window past ~43 ms. Deliberately not clamped: a value over 1000 is the diagnosis. */
static uint32_t dsploadprof_pct_x10( uint32_t ticks, uint32_t window_ticks )
{
    if( window_ticks == 0u )
    {
        return 0u;
    }
    return (uint32_t)( ( (uint64_t)ticks * 1000ULL ) / (uint64_t)window_ticks );
}

static void audio_transport_dbg_print_dsploadprof(
    const audio_transport_snapshot_t* snapshot )
{
    static uint32_t s_cfg_epoch  = UINT32_MAX;   // last epoch the profiler was configured for
    static uint32_t s_cfg_window = 0u;           // last window length in high-res-timer counts

    /* us -> high-res-timer counts via FCY: main.c initialises the timer with timer_clk_hz = FCY,
     * so one count is one instruction cycle. The tick rate is not exposed by the timer HAL, so
     * the conversion belongs to the application -- same as the per-leg lines above. */
    const uint32_t window_us    = s_dsploadprof_window_us;
    const uint32_t window_ticks =
        (uint32_t)( ( (uint64_t)window_us * (uint64_t)FCY ) / 1000000ULL );

    if( window_ticks == 0u )
    {
        return;
    }

    /* Re-base on a new stream epoch (initial-start / restart / rate-change / clock-resume /
     * phase- & frmerr-recovery) so a stopped or reconfiguring gap never enters the statistics,
     * and on any window-length change. Unlike the predecessor, nothing about this window depends
     * on WHICH leg is running -- that dependence was the bug. */
    if( ( snapshot->stream_epoch != s_cfg_epoch ) || ( window_ticks != s_cfg_window ) )
    {
        s_cfg_epoch  = snapshot->stream_epoch;
        s_cfg_window = window_ticks;
        nora_cpu_load_prof_configure( window_ticks );
    }

    nora_cpu_load_snapshot_t p;
    if( !nora_cpu_load_prof_get( &p, true ) )
    {
        return;   // profiler never configured (high-res timer down)
    }

    if( p.windows == 0u )
    {
        /* No window closed inside this report interval: the report period is shorter than the
         * measurement window. Say so rather than printing a mean over zero windows. */
        printf("DSPload:win=%lu.%03lums n=0 (report interval shorter than the window)\n",
               (unsigned long)( window_us / 1000u ),
               (unsigned long)( window_us % 1000u ));
        return;
    }

    const uint32_t mean_a      = p.mean_self_ticks[NORA_CPU_LOAD_OWNER_LEG_A];
    const uint32_t mean_b      = p.mean_self_ticks[NORA_CPU_LOAD_OWNER_LEG_B];
    const uint32_t mean_stolen = p.mean_stolen_ticks[0] + p.mean_stolen_ticks[1];
    const uint32_t win_ticks   = p.window_period_ticks;

    /*
     * P1 diet (2026-08-27). Three of the eight percentages were EXACTLY derivable from their
     * neighbours -- self = A_self + B_self, demand = self + stolen, and
     * max_demand differs from max_self only by stolen -- and `win=`/`n=` are constants while the
     * profiler is healthy. What is left is the two per-leg loads and the peak; stolen (and with it
     * max_demand) appears only when a higher-priority vector actually took time, n= only when the
     * accounting is suspect. The window size is stated once, at the first report.
     * [internal] design_brief_2026-08-27_telemetry_derived_thresholds_and_diet.md P1.
     */
    {
        static uint8_t win_announced = 0u;
        if( !win_announced )
        {
            win_announced = 1u;
            printf("DSPloadcfg:win=%lu.%03lums (self = A+B; demand = self+stolen; stolen/n printed only when they matter)\n",
                   (unsigned long)( window_us / 1000u ),
                   (unsigned long)( window_us % 1000u ));
        }
    }

    printf("DSPload:A=%lu.%lu%% B=%lu.%lu%% max=%lu.%lu%% ",
           (unsigned long)( dsploadprof_pct_x10( mean_a, win_ticks ) / 10u ),
           (unsigned long)( dsploadprof_pct_x10( mean_a, win_ticks ) % 10u ),
           (unsigned long)( dsploadprof_pct_x10( mean_b, win_ticks ) / 10u ),
           (unsigned long)( dsploadprof_pct_x10( mean_b, win_ticks ) % 10u ),
           (unsigned long)( dsploadprof_pct_x10( p.max_sum_ticks, win_ticks ) / 10u ),
           (unsigned long)( dsploadprof_pct_x10( p.max_sum_ticks, win_ticks ) % 10u ));

    if( mean_stolen != 0u )
    {
        printf("stolen=%lu.%lu%% max_demand=%lu.%lu%% ",
               (unsigned long)( dsploadprof_pct_x10( mean_stolen, win_ticks ) / 10u ),
               (unsigned long)( dsploadprof_pct_x10( mean_stolen, win_ticks ) % 10u ),
               (unsigned long)( dsploadprof_pct_x10( p.max_demand_ticks, win_ticks ) / 10u ),
               (unsigned long)( dsploadprof_pct_x10( p.max_demand_ticks, win_ticks ) % 10u ));
    }

    /* Overrun stated directly rather than as a negative margin, and only when it happened. */
    if( p.max_demand_ticks > win_ticks )
    {
        const uint32_t over_us10 =
            nora_high_res_timer_count_to_us_x10( p.max_demand_ticks - win_ticks );

        printf("over=%lu.%luus ", (unsigned long)( over_us10 / 10u ),
                                  (unsigned long)( over_us10 % 10u ));
    }

    /* n= windows closed in this report interval; the reader can check it against
     * (report period / window). bad= four PERMANENT-ZERO checks: unbalanced enter/exit, intervals
     * measured negative, grid re-bases (no hook ran for several windows), ownership nested deeper
     * than tracked. The hooks run interrupt-masked, so unlike the predecessor's race= these are
     * not an expected small loss -- any non-zero value means the accounting is wrong and the
     * percentages are suspect. */
    /* bad= stays unconditional: it is a harm counter, and a reader who greps for it must not have
     * to treat "absent" as "zero". n= joins it only when it is non-zero, because that is when the
     * window count is needed to judge how suspect the percentages are. */
    if( ( p.unbalanced | p.neg_delta | p.rebase | p.depth_overflow ) != 0u )
    {
        printf("n=%lu ", (unsigned long)p.windows);
    }
    printf("bad=%u/%u/%u/%u\n",
           (unsigned)p.unbalanced,
           (unsigned)p.neg_delta,
           (unsigned)p.rebase,
           (unsigned)p.depth_overflow);
}

// Per-leg TDM line tail verbosity (local to this function only; #undef'd right after).
// 0 = compact: only (run,act,blk,miss) -- the everyday health fields.
// 1 = verbose: append the deep-debug DMA/SPI counters (dov/dirq/ds/rov/tur/frm) that were
//     added during bring-up. Flip to 1 when chasing a DMA/framing fault.
#ifndef AUDIO_TRANSPORT_DBG_LEG_VERBOSE
#define AUDIO_TRANSPORT_DBG_LEG_VERBOSE  0
#endif

static void audio_transport_dbg_print_leg_end(
    const audio_transport_leg_snapshot_t* leg )
{
#if AUDIO_TRANSPORT_DBG_LEG_VERBOSE
    printf(" (run,act,blk,miss)=(%d,%d,%lu,%lu) dov=%lu dirq=%lu ds=0x%08lX rov=%lu tur=%lu frm=%lu\n",
           (int)leg->running, (int)leg->active,
           (unsigned long)leg->block_count,
           (unsigned long)leg->deadline_miss_count,
           (unsigned long)leg->rx_dma_overrun_count,
           (unsigned long)leg->rx_dma_other_irq_count,
           (unsigned long)leg->rx_dma_last_status,
           (unsigned long)leg->rx_overrun_block_count,
           (unsigned long)leg->tx_underrun_block_count,
           (unsigned long)leg->frame_error_block_count);
#else
    printf(" (run,act,blk,miss)=(%d,%d,%lu,%lu)\n",
           (int)leg->running, (int)leg->active,
           (unsigned long)leg->block_count,
           (unsigned long)leg->deadline_miss_count);
#endif // AUDIO_TRANSPORT_DBG_LEG_VERBOSE
}

#undef AUDIO_TRANSPORT_DBG_LEG_VERBOSE

bool audio_transport_codec_b_missing_stop_active( void )
{
#if NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
    return s_codec_b_missing_stop_latched;
#else
    // Single-codec build, or the AK128 J3 bring-up build: the latch this reports
    // does not exist here (never set), so callers with their own periodic
    // telemetry (see classic_demo_app.c) should never silence on its account.
    return false;
#endif // NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
}

// Owns the app-level telemetry line(s): TDM stream health + per-ISR load, the ASRC state,
// and the CCP-measured rates/ratio. SELF-GATED on s_dbg_period_ms and meant to be called
// every iteration of main()'s loop (it prints only when the period has elapsed). Consumes the
// neutral transport snapshot and derives the block-count rates; the ASRC/CCP details come from
// their own modules. (Moved here from main.c so each module owns its own debug output.)
void audio_transport_dbg_print( void )
{
#if NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B
    // Latched codec-B-missing stop: replace the normal telemetry with the guidance line,
    // repeated every 2 s, for as long as the condition holds. A one-shot print is not
    // enough -- a USB-CDC terminal that reconnects after the boot-time banner already went
    // by (the port re-enumerates on reset, same timing gap as a missed startup banner)
    // would otherwise find a silent, healthy-looking console with nothing to explain why
    // there is no audio.
    if( s_codec_b_missing_stop_latched )
    {
        const uint32_t cur = GetTicks();
        if( (uint32_t)( cur - s_codec_b_missing_last_prt_ms ) >= 2000u )
        {
            s_codec_b_missing_last_prt_ms = cur;
            audio_transport_print_codec_b_missing_guidance();
        }
        return;
    }
#endif // NORA_TDM_USE_SPI2 && !APP_AK128_J3_TDM_B

