sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
    static uint32_t last_prt = UINT32_MAX;
    const uint32_t  cur = GetTicks();
    // period 0 == telemetry DISABLED (documented contract of audio_transport_set_dbg_period_ms). Without
    // this explicit guard the unsigned compare `(cur-last_prt) < 0` is never true, so period 0 would print
    // on EVERY call (a flood) instead of disabling output. Guard it so 0 truly silences the line.
    if( ( s_dbg_period_ms == 0u ) ||
        ( (uint32_t)( cur - last_prt ) < s_dbg_period_ms ) )
    {
        return;
    }
    last_prt = cur;

    audio_transport_snapshot_t transport_snapshot;
    const bool transport_snapshot_valid =
        audio_transport_snapshot_take_window( &transport_snapshot );
    /*
     * P1 (2026-08-27): this line is STATE, not health -- every field of it is constant while the
     * stream runs, so repeating it every ~2 s buried the restarts and failures it exists to
     * announce. Print it when any field CHANGES (and once at the first report), which is exactly
     * the transition edge. Nothing is lost: the same snapshot is available on demand.
     * [internal] design_brief_2026-08-27_telemetry_derived_thresholds_and_diet.md P1.
     */
    static uint8_t  stream_memo_valid = 0u;
    static uint32_t stream_memo_epoch = 0u;
    static uint8_t  stream_memo_flags = 0u;
    static uint8_t  stream_memo_transition = 0u;
    static uint8_t  stream_memo_error = 0u;
    const uint8_t   stream_flags = transport_snapshot_valid
        ? (uint8_t)( ( transport_snapshot.qualified_running               ? 0x01u : 0u )
                   | ( transport_snapshot.safe_mute_latched               ? 0x02u : 0u )
                   | ( transport_snapshot.transition_failed               ? 0x04u : 0u )
                   | ( transport_snapshot.mute_held_by_failed_transition  ? 0x08u : 0u ) )
        : 0u;
    const bool stream_changed = transport_snapshot_valid
        && ( ( stream_memo_valid == 0u )
          || ( stream_memo_epoch != transport_snapshot.stream_epoch )
          || ( stream_memo_flags != stream_flags )
          || ( stream_memo_transition != (uint8_t)transport_snapshot.last_transition )
          || ( stream_memo_error != (uint8_t)transport_snapshot.last_transition_error ) );

    if( transport_snapshot_valid && stream_changed )
    {
        stream_memo_valid      = 1u;
        stream_memo_epoch      = transport_snapshot.stream_epoch;
        stream_memo_flags      = stream_flags;
        stream_memo_transition = (uint8_t)transport_snapshot.last_transition;
        stream_memo_error      = (uint8_t)transport_snapshot.last_transition_error;

        printf("STREAM epoch=%lu qualified=%d transition=%s safe_mute=%d failed=%d error=%s mute_held=%d\n",
               (unsigned long)transport_snapshot.stream_epoch,
               transport_snapshot.qualified_running ? 1 : 0,
               audio_transport_transition_name( transport_snapshot.last_transition ),
               transport_snapshot.safe_mute_latched ? 1 : 0,
               transport_snapshot.transition_failed ? 1 : 0,
               audio_transport_transition_error_name(
                   transport_snapshot.last_transition_error ),
               transport_snapshot.mute_held_by_failed_transition ? 1 : 0 );
    }

#if RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED
    // Step-1 phase-probe readout: samples = leg-A blocks observed; mismatch = blocks where
    // leg A/B were on DIFFERENT ping-pong halves (=phase offset -> the tearing cause);
    // unresolved = a live-DMA snapshot fell outside its buffer (reload boundary). In-phase
    // and locked => mismatch stays 0 across minutes and restarts. (h1,h2)=last sampled halves.
    printf("PHASE: samp=%lu mism=%lu unres=%lu (h1,h2)=(%d,%d) | wdiff last=%ld[%ld..%ld] tail_tear=%lu\n",
           (unsigned long)s_phase_samples, (unsigned long)s_phase_mismatch,
           (unsigned long)s_phase_unresolved, s_phase_h1, s_phase_h2,
           (long)s_phase_wdiff_last, (long)s_phase_wdiff_min, (long)s_phase_wdiff_max,
           (unsigned long)s_phase_tail_tear);
#endif // RESOLVED_TRANSPORT_PHASE_PROBE_ENABLED

#if RESOLVED_SAI_TEST_LIVE_ENABLED
    audio_transport_sai_live_dbg_print();
#endif // RESOLVED_SAI_TEST_LIVE_ENABLED

    // Consolidated TDM stream-health + per-ISR load. Consume the neutral snapshot so
    // console formatting does not query HAL status directly. take_window() cleared the
    // sampled callback peaks, preserving the existing per-print-window max behavior.
    // Application-specific diagnostics are printed separately from the neutral TDM lines.
    if( transport_snapshot_valid )
    {
        const audio_transport_leg_snapshot_t* leg_a =
            &transport_snapshot.legs[AUDIO_TRANSPORT_LEG_A];
        audio_transport_dbg_print_leg_begin( leg_a, AUDIO_TRANSPORT_LEG_A );

        audio_transport_dbg_print_leg_end( leg_a );

        // Logical leg-B health (independent block ISR when the domains are asynchronous).
        if( transport_snapshot.leg_count > AUDIO_TRANSPORT_LEG_B )
        {
#if RESOLVED_TRANSPORT_LEG_B_BLOCK_IRQ_GATED
            // Say it instead of printing frozen numbers. Every figure on a leg-B line comes from
            // its block ISR, and that ISR is deliberately masked here -- a stalled blk count and a
            // stale max are precisely how a dead leg looks, so printing them invites a hunt for a
            // fault that does not exist. Codec B is streaming: leg A's callback fills its TX half.
            printf("TDM%u:irq-gated (RX unread, TX mirrored by TDM%u -- no leg-B ISR)\n",
                   (unsigned)RESOLVED_TRANSPORT_LEG_B_SPI_INSTANCE,
                   (unsigned)RESOLVED_TRANSPORT_LEG_A_SPI_INSTANCE);
#else
            const audio_transport_leg_snapshot_t* leg_b =
                &transport_snapshot.legs[AUDIO_TRANSPORT_LEG_B];
            audio_transport_dbg_print_leg_begin( leg_b, AUDIO_TRANSPORT_LEG_B );
            audio_transport_dbg_print_leg_end( leg_b );
#endif
        }

        // Engine-wide DSP load: the legs' own (preemption-excluded) CPU time over a fixed
        // measurement window that is independent of the block period -- see its header.
        audio_transport_dbg_print_dsploadprof( &transport_snapshot );

        audio_application_telemetry_print(
            &transport_snapshot, cur, audio_transport_frmerr_recover_count() );

        // Blank line closing the report: one telemetry set is STREAM ... CCP, and the sets
        // arrive every APP_..._DBG_PERIOD_MS, so without a separator a scrolling console
        // gives no visual cue where one snapshot ends and the next begins.
        printf("\n");
    }
}

void audio_transport_start( void )
{
#if RESOLVED_SAI_TEST_LIVE_ENABLED
    audio_transport_cmsis_sai_start();
#else
    audio_transport_hal_start();
#endif // RESOLVED_SAI_TEST_LIVE_ENABLED
}

bool audio_transport_manage( void )
{
#if RESOLVED_SAI_TEST_LIVE_ENABLED
    return audio_transport_cmsis_sai_manage();
#else
    return audio_transport_hal_manage();
#endif // RESOLVED_SAI_TEST_LIVE_ENABLED
}

bool audio_transport_restart( void )
{
#if RESOLVED_SAI_TEST_LIVE_ENABLED
    return audio_transport_restart_route( AUDIO_TRANSPORT_ROUTE_CMSIS_SAI,
                                    AUDIO_TRANSPORT_TRANSITION_MANUAL_RESTART );
#else
    return audio_transport_restart_route( AUDIO_TRANSPORT_ROUTE_HAL_DIRECT,
                                    AUDIO_TRANSPORT_TRANSITION_MANUAL_RESTART );
#endif // RESOLVED_SAI_TEST_LIVE_ENABLED
}

bool audio_transport_restart_declick( uint8_t declick_mask )
{
    // Declick research (one-shot): arm the codec strategy bitmask for the duration of this restart,
    // then re-arm NONE so the auto-recovery / shipping restart path always runs on baseline. A mask of
    // 0 is exactly audio_transport_restart(). See wm8904_set_pending_declick() / research doc.
    printf(" [declick] one-shot restart with mask=0x%02x\n", (unsigned)declick_mask );
    wm8904_set_pending_declick( declick_mask );
    const bool ok = audio_transport_restart();
    wm8904_set_pending_declick( (uint8_t)WM8904_DECLICK_NONE );
    return ok;
}

bool audio_transport_declick_research_available( void )
{
    return wm8904_declick_research_available();
}

void audio_transport_declick_print_help( void )
{
    wm8904_declick_print_strategy_help();
}

void audio_transport_declick_print_status( void )
{
    // Reports whether a cold-boot STARTUP DC-servo run has captured offsets for each codec. WARM_SERVO
    // (mask bit1) uses DCS_TRIG_DAC_WR only when captured; otherwise it falls back to a STARTUP servo.
    printf("   servo-captured: A=%d", (int)wm8904_declick_servo_captured( I2C_INST_A ) );
#if NORA_TDM_USE_SPI2
    printf(" B=%d", (int)wm8904_declick_servo_captured( I2C_INST_B ) );
#endif
    // Only mention WARM_SERVO where it exists: with the research code compiled out the capture
    // still runs (it is part of the ordinary STARTUP servo path) but nothing can consume it.
    if( wm8904_declick_research_available() )
    {
        printf(" (WARM_SERVO falls back to STARTUP until captured)");
    }
    printf("\n");
}

bool audio_transport_restart_codec_b_only_declick( uint8_t declick_mask )
{
    // Declick research (automated loopback measurement): re-init ONLY the CODEC-B chip with the declick
    // strategy `declick_mask`, WITHOUT stopping the dsPIC transport or touching CODEC-A. Requires the
    // independent B-codec-master topology (B has its own XTAL/clock domain), so A keeps streaming and can
    // record B's analog output looped back into A's line-in (B HPOUT -> cable -> A LINE-IN -> A ADC).
    //
    // This runs synchronously in the caller's (main-loop console) context, so the FRMERR/liveness manage
    // tick -- also main-loop -- cannot fire a whole-transport recovery mid-measurement. B's clock does
    // hiccup on a non-WARM restart (R0 reset); any resulting frame-slip is recovered by the manage loop
    // AFTER this returns (A is unaffected during the window).
#if NORA_TDM_USE_SPI2 && (RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE)
    printf(" [declick-B] codec-B-only restart mask=0x%02x (A keeps running)\n", (unsigned)declick_mask );
    (void)audio_transport_declick_b_shutdown_only( declick_mask );
    return audio_transport_declick_b_startup_only( declick_mask );
#else
    (void)declick_mask;
    printf(" [declick-B] not supported: requires the independent B-codec-master topology\n");
    return false;
#endif
}

// Phase-split B-only declick (for isolating SHUTDOWN vs STARTUP pop). The measurement harness arms the
// pop meter, runs one phase, reads the meter, then runs the other -- so each phase's pop is attributed
// separately. Same topology guard / synchronous-context reasoning as the combined call above.
bool audio_transport_declick_b_shutdown_only( uint8_t declick_mask )
{
#if NORA_TDM_USE_SPI2 && (RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE)
    wm8904_set_pending_declick( declick_mask );
    wm8904_set_analog_output_mute( I2C_INST_B, true );   // mute B (ramp-down if mask bit4/E)
    wm8904_shutdown( I2C_INST_B );                        // strategy-aware discharge (quench/ordered/WSEQ)
    // pending mask intentionally left armed; the paired startup_only consumes and clears it.
    return true;
#else
    (void)declick_mask;
    return false;
#endif
}

bool audio_transport_declick_b_startup_only( uint8_t declick_mask )
{
#if NORA_TDM_USE_SPI2 && (RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE)
    wm8904_set_pending_declick( declick_mask );
    /*
     * Re-init B as codec-master (endpoint clock) in ITS OWN converter role. The role
     * is a property of the leg, not of this call: at 96 kHz leg B is DAC-only,
     * because the WM8904 cannot run ADC and DAC together above 48 kHz. Hardcoding
     * ADC+DAC here made a rate change on leg B unrepresentable -- which is why
     * "*ar 1 8" (B -> 48 kHz) reported success while B kept running at 96 kHz.
     */
    const bool ok = wm8904_init_role( I2C_INST_B, true, AUDIO_TRANSPORT_LEG_B_ROLE );
    if( ok )
    {
        // Only unmute a codec that actually re-initialised. Unmuting a failed/unreachable B
        // would drive a broken analog block (audible pop) and yield a meaningless measurement --
        // match the shipping start_route_impl contract (unmute gated on apply success).
        wm8904_set_analog_output_mute( I2C_INST_B, false );   // unmute B (soft-ramp up if mask bit2/D)
    }
    wm8904_set_pending_declick( (uint8_t)WM8904_DECLICK_NONE );
    return ok;
#else
    (void)declick_mask;
    return false;
#endif
}

#if NORA_TDM_USE_SPI2 && (RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE)
// Fast LEG-B rate change: re-init ONLY codec-B (at its already-set new rate) while the transport and
// codec-A keep running. Reuses the *ap codec-B-only primitives: mute B, strategy-none shutdown, re-init
// B as codec-master (which picks up the new wm8904 rate), unmute B. B briefly drops its BCLK while
// re-initing, so the dsPIC SPI2 slave sees a transient frame-slip -- cleared here so the manage loop
// does not escalate to a full-transport recovery. Codec-A never stops and the A-side DSP is untouched
// (A's rate is unchanged, so prepare_client would be a no-op anyway). Roughly half the switch time of
// the whole-transport restart.
//
// The client's stream state IS re-locked here (reset_stream_state), exactly as the full-transport
// restart does at audio_transport_start_hal_transport(). Without it the ASRC feed-forward ratio servo
// cannot follow a large rate step: asrc_apply_ratio() only re-centres the FIFO and re-seeds step_state
// on the invalid->valid transition, so a live (ratio>0) update just moves the target while step_state
// crawls at ASRC_STEP_SLEW (~2e-6/block). Over a 48<->32 (33%) jump the 128-frame ring saturates in ms
// and never recovers. Re-locking drives the ratio back to 0 and re-arms the CCP acquire, so the next
// feed-forward value hits the invalid->valid path: re-centre + re-seed step_state to the new rate.
// This is the SAME re-lock the cold-start path relies on (producer already live, first ratio arrives),
// so it is safe to invoke here without stopping the transport.
static bool audio_transport_reconfigure_codec_b_only( void )
{
    printf(" [rate-B] fast codec-B-only re-init at %lu Hz (transport + codec-A keep running)\n",
           (unsigned long)wm8904_get_rate_hz( I2C_INST_B ) );
    (void)audio_transport_declick_b_shutdown_only( (uint8_t)WM8904_DECLICK_NONE );
    const bool ok = audio_transport_declick_b_startup_only( (uint8_t)WM8904_DECLICK_NONE );
    delay_ms( 50 );
    audio_transport_frmerr_reset();   // clear the transient B-clock frame-slip (benign; B re-inited clean)

