sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
    // Re-lock the application stream state (ASRC servo + CCP acquire) to B's new rate. Mirrors the
    // full-restart re-lock without stopping the transport; see the block comment above.
    const audio_transport_client_t* client = audio_transport_client_get();
    if( ( client != NULL ) && ( client->reset_stream_state != NULL ) )
    {
        client->reset_stream_state( client->user );
    }
    return ok;
}
#endif // fast codec-B-only rate change available

bool audio_transport_leg_rate_is_supported( transport_leg_t leg,
                                            uint32_t        sample_rate_hz,
                                            const char**    reason_out )
{
    const char* reason = NULL;
    bool ok = false;

#if RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE
    wm8904_role_t role;
    switch( leg )
    {
        case TRANSPORT_LEG_A: role = AUDIO_TRANSPORT_LEG_A_ROLE; ok = true; break;
        case TRANSPORT_LEG_B: role = AUDIO_TRANSPORT_LEG_B_ROLE; ok = true; break;
        default: reason = "unknown transport leg"; break;
    }

    /*
     * >= 88.2 kHz is the WM8904's own high-rate boundary (datasheet), which is why
     * the test is written as a threshold rather than against 96 kHz. In the rate
     * table 96 kHz is the ONLY rate on this side of it -- there is no 88.2 kHz row --
     * so the messages below name 96 kHz, which is what a user can actually ask for.
     */
    if( ok && ( sample_rate_hz >= 88200u ) )
    {
        /*
         * Both conditions are build facts, so they can be answered here with no
         * codec access. Checking them BEFORE the mute-bounded restart is the whole
         * point: a request that cannot succeed should not cost a stream teardown.
         */
        if( RESOLVED_TRANSPORT_SLOTS_PER_FRAME != 2u )
        {
            ok = false;
            reason = "96 kHz needs a 2-slot I2S frame; this build is TDM8";
        }
        else if( role == WM8904_ROLE_ADC_DAC )
        {
            ok = false;
            reason = "96 kHz cannot run ADC and DAC together; this leg is full-duplex";
        }
    }
#else
    (void)leg;
    (void)sample_rate_hz;
    reason = "runtime rate change needs an endpoint-clocked leg B (codec-master build)";
#endif

    if( reason_out != NULL ) { *reason_out = reason; }
    return ok;
}

bool audio_transport_reconfigure_leg_rate_hz( transport_leg_t leg,
                                              uint32_t        sample_rate_hz )
{
#if RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE
    uint8_t codec_instance;
    uint8_t leg_index;
    switch( leg )
    {
        case TRANSPORT_LEG_A:
            codec_instance = I2C_INST_A;
            leg_index = AUDIO_TRANSPORT_LEG_A;
            break;
        case TRANSPORT_LEG_B:
            codec_instance = I2C_INST_B;
            leg_index = AUDIO_TRANSPORT_LEG_B;
            break;
        default: return false;
    }

    /*
     * Reject an impossible target BEFORE the mute-bounded restart, so a bad request
     * costs nothing instead of tearing down a working stream and failing afterwards.
     * Gated here (not only in the console) so every caller gets the same contract.
     */
    {
        const char* reason = NULL;
        if( !audio_transport_leg_rate_is_supported( leg, sample_rate_hz, &reason ) )
        {
            printf(" [rate] leg %c -> %lu Hz rejected: %s\n",
                   ( leg == TRANSPORT_LEG_A ) ? 'A' : 'B',
                   (unsigned long)sample_rate_hz,
                   ( reason != NULL ) ? reason : "unsupported" );
            return false;
        }
    }

    const uint32_t previous_rate_hz = wm8904_get_rate_hz( codec_instance );
    if( !wm8904_set_rate_hz( codec_instance, sample_rate_hz ) )
    {
        return false;
    }

/*
 * A/B SWITCH for the rate-monotonic-ISR stack-error investigation. Set to 0 and a leg-B rate
 * change takes the SAME whole-transport restart path leg A takes, instead of the live fast path
 * below.
 *
 * WHY IT EXISTS, and why it is a switch rather than a fix. The RM priority assignment
 * (asrc_audio_path_apply_isr_priorities(), added by a9f8cc9) states as its contract that it runs
 * "while the transport is stopped ... before any domain starts", and is "deliberately NOT
 * dynamic". The ASRC layer registers it behind reset_stream_state(), and the fast path below
 * calls reset_stream_state() with the transport DELIBERATELY still running -- so the one callback
 * is reached down two paths that make OPPOSITE claims about whether anything is streaming. That
 * is a control-flow contradiction, not a stale comment: measured on hardware, the fast path does
 * re-run the assignment, and it does so with both legs' ISRs live. It is NOT self-preemption --
 * the assignment runs at task level and so cannot execute while an ISR is in flight, and a source
 * at the same IPL as the running level does not preempt it either -- but it does update the two
 * legs' IPC in SEQUENCE, so between the two writes the priority map is neither the old one nor the
 * new one, and it resets ASRC stream state while the producers of that state keep firing. Note the
 * DMA HAL's ordinary reconfigure path masks the IRQ before rewriting a live channel for exactly
 * this class of reason; the RM priority setter does not.
 *
 * Setting this to 0 restores a9f8cc9's own precondition WITHOUT touching one line of the RM logic,
 * which is what makes the resulting sweep a clean discriminator:
 *   STACK ERROR = 0 here  -> the fault needs the live reconfigure, and the fix belongs at that seam
 *   STACK ERROR persists  -> live IPC change is not the mechanism; look elsewhere
 * The cost of 0 is only switch TIME (leg B stops paying for its own clock domain); it is not a
 * capability change, which is why it is safe to ship either value while the question is open.
 * [internal] report_ak512_16ch_mixed_rate_margin_cause_2026-08-24.md section 19.
 */
#ifndef APP_TRANSPORT_LEG_B_FAST_RATE_CHANGE
#define APP_TRANSPORT_LEG_B_FAST_RATE_CHANGE 1
#endif

