sulaolab/dspic33ak-audio-dsp-sonora/src/app/audio_transport/audio_transport.c
#if APP_TRANSPORT_LEG_B_FAST_RATE_CHANGE && NORA_TDM_USE_SPI2 && (RESOLVED_TRANSPORT_LEG_B_CLOCK_SOURCE == TRANSPORT_CLOCK_SOURCE_ENDPOINT_VALUE)
    // Fast path: a LEG-B rate change on a live stream only needs codec-B re-inited (it owns its own
    // clock domain; the dsPIC SPI2 slave follows). Codec-A and the DSP are unaffected -- A's rate is
    // unchanged and the 16ch ASRC decouples the two legs -- so re-tuning nothing and re-starting nothing
    // else roughly halves the switch time versus the whole-transport restart below. LEG-A still takes the
    // full restart path (its fs-parameterized DSP re-tune via prepare_client requires the transport stopped).
    if( leg == TRANSPORT_LEG_B && TDM_activated )
    {
        if( audio_transport_reconfigure_codec_b_only() )
        {
            s_current_configured_rate_hz[leg_index] = sample_rate_hz;
            return true;
        }
        // Fast path failed: restore the previous rate and re-init B back to it (transport still live).
        (void)wm8904_set_rate_hz( codec_instance, previous_rate_hz );
        printf(" [rate-B] fast re-init failed; requested rate restored to %lu Hz\n",
               (unsigned long)previous_rate_hz );
        (void)audio_transport_reconfigure_codec_b_only();
        return false;
    }
#endif

#if RESOLVED_SAI_TEST_LIVE_ENABLED
    const audio_transport_route_t route = AUDIO_TRANSPORT_ROUTE_CMSIS_SAI;
#else
    const audio_transport_route_t route = AUDIO_TRANSPORT_ROUTE_HAL_DIRECT;
#endif
    if( audio_transport_restart_route( route, AUDIO_TRANSPORT_TRANSITION_RATE_CHANGE ) )
    {
        s_current_configured_rate_hz[leg_index] = sample_rate_hz;
        return true;
    }

    (void)wm8904_set_rate_hz( codec_instance, previous_rate_hz );
    printf(" [rate-change] apply failed; requested rate restored to %lu Hz\n",
           (unsigned long)previous_rate_hz );

    if( !TDM_activated )
    {
        const bool rollback_ok = audio_transport_restart_route(
            route, AUDIO_TRANSPORT_TRANSITION_RATE_CHANGE_ROLLBACK );
        printf(" [rate-change] rollback restart %s\n",
               rollback_ok ? "restored previous stream" : "FAILED (muted/stopped)" );
    }
    return false;
#else
    (void)leg;
    (void)sample_rate_hz;
    return false;
#endif // endpoint-owned leg-B clocking
}
